[
    {
        "id": 10,
        "name": "8020 SHORTS",
        "description": "Our 8020 shorts are tailored with the best cotton material for the comfort of wearer. Our Blue Stylish Denim Jacket with cotton elastane provides comfort during your daily work. It has button closure and has relaxed fit. Experience unparalleled comfort and performance with our classic work polo. Featuring a cut-and-sew design with contrasting piping, this polo offers exceptional moisture management and breathability. The lightweight mesh with contrasting fabric vents moisture, preventing buildup and keeping the wearer cool and comfortable throughout the work shift. Experience unparalleled comfort and performance with our classic pants designed to keep you comfortable and confident on the job. With durable materials, reinforced stitching, and multiple pockets for essential tools, these pants are built to withstand the demands of your daily routine. Whether you’re in healthcare, hospitality, or retail, our pants offer the perfect combination of style, function, and durability. Our 1020 shirt is a plain working shirt essential for your wardrobe. It is both smart and casual.  It features useful chest pockets and button-down collar for added detail. Our two-piece medical scrub for men is a great option for healthcare professionals who want to look stylish and professional. The eco-friendly scrub set features a unique triple-stitch design that enhances your appearance without compromising functionality. The V-neck top comes with multiple pockets, making it easy for you to access your essentials. The pants offer comfortable movement and flexibility for long shifts. Whether you’re a doctor, nurse, or any other healthcare professional, our two-piece medical scrub for men is the perfect choice to help you look and feel your best while at work. RUHE SCRUBS SET",
        "features": [
            "Front closure with stud button over.",
            "Two side pockets",
            "Two front pockets with flaps",
            "Adjustable cuffs",
            "Zip fly",
            "Cotton poly material",
            "Side bellow pockets",
            "VANTGUARD POLO SHIRT",
            "CLASSIC SERVICES PANTS",
            "Classic straight-fit",
            "Back flap pockets",
            "Best for services industry",
            "Two side pockets",
            "Contrast side seams",
            "Underarms elbow vents",
            "Contrasting piping detail",
            "Contrast side vents",
            "Two button placket",
            "Arm cut & sew in hi-vis contrast piping",
            "79",
            "midassafety.com",
            "Shell Fabric: 65% Cotton, 35% Polyester, 200 GSM",
            "Shell Fabric: 65% Cotton, 35% Polyester Ripstop, 240 GSM",
            "80",
            "midassafety.com",
            "1020 SHIRT",
            "Button down closure",
            "Two front pockets with flaps.",
            "Adjustable cuffs",
            "HEALTH",
            "CARE",
            "ECO-BLUE SCRUBS SET",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "Darted front seams with multiple pockets",
            "Multiple bottom pockets",
            "82",
            "midassafety.com",
            "FRIEDEN SCRUBS SET"
        ],
        "fabrics": [
            "cotton 80%, polyester 20% 245 GSM",
            "98% Cotton, 2% Elastane Denim 270 gsm|8oz",
            "100% cotton 200 gsm|5.9oz",
            "Shell: 81.5% PIW Cotton, 17.5% Reprieve Polyster, 1% Elastane, 340 GSM",
            "Our Men’s Casual Two-Piece Denim Medical Scrub is perfect for healthcare",
            "professionals who want to look and feel their best at work. This eco-friendly",
            "set features a unique triple-stitch design that adds a touch of style without",
            "compromising on professionalism. The V-neck top has multiple pockets",
            "that make it easy to access your essentials, while the pants are designed",
            "for comfort and mobility, allowing you to move with ease during long shifts.",
            "Whether you’re a doctor, nurse, or any other healthcare professional, this",
            "scrub will give you the confidence you need to perform your job with ease.",
            "Add a touch of excitement to your hectic workday with our Two-Tone",
            "Medical Scrub. This flattering-fit set features a V-neck and short sleeves",
            "for a stylish and professional look. The matching pants have an elastic",
            "waist for long-lasting comfort during your shift.",
            "Whether you’re a doctor, nurse, or other healthcare professio"
        ]
    },
    {
        "id": 11,
        "name": "Advance Tech Jacket",
        "description": "Stay safe and visible in dangerous environments with the Lit- Armor High-Visibility FR Vest. This lightweight, flexible vest features FR active lighting technology, with integrated FR Lightning piping that is visible from up to 3 kilometers away. The LED lights can be turned on and off with a power button and have three different light modes to choose from. The vest is also lined with Meta Aramid lining, providing excellent heat and flame resistance. Its soft texture and flexibility make it ideal for use in low-lit or hot temperatures. The Ardor Advance Tech jacket offers augmented Heat Sensing technology with a stylish look of a high-performance softshell jacket. This multi-feature, DWR Softshell jacket is made using a durable softshell textile outer with attached quilting to give warmth and protect the wearer in cold working conditions. The integrated smart heating solution has programmable module which can be autoregulated with temperature control sensors. The Jacket has ample storage space through its spacious front pockets providing wearers with a practical selection. The Hi-Vis Illuminer Tech Jacket is a high-performance workwear jacket that provides comfort, ease of movement, and high visibility in low-light conditions. The jacket is made of industrial launderable stretch material and features Smart Led Visibility technology, a programmable module that provides high visibility through smart Textile fabric lightening patches attached to the back and sleeves, which can be controlled through 3 modes for static, motion, and fall detection. The jacket is also Bluetooth-enabled, allowing supervisors to locate workers in case of an emergency.",
        "features": [
            "Dynamic module which is programmable to set up lighting",
            "signals based on worker activity.",
            "Allows you to be highly visible without being illuminated by a",
            "lighting source.",
            "Smart light patched on sleeves and back, Reflective tapes for",
            "Hi-visibility",
            "The Smart tech in the garment uses fiber and sensor",
            "technology to automate and optimize light cycles to provide",
            "better signaling protection.",
            "Warning of danger through different lighting scenarios created",
            "by the user: Static detection, Motion detection, Fall detection.",
            "Electronics can store and enable data analytics Features",
            "Lighting autonomy: 18h",
            "Washable and DWR shell fabric",
            "Front bellow pockets for storage",
            "High visibility over a long distance",
            "Detachable quilt and fur hood lining to keep the inside",
            "temperature warm and comf",
            "LIT-ARMOR FR VEST",
            "Flame Retardant fabric & trims",
            "3 modes of light intensity and flashing mode",
            "Good visibility (up to 2 km) in dark, fog, heavy rain, and snow",
            "Therien Heat sensing autoregulated module",
            "Battery and heating element Included",
            "Unique system: the only heated clothing kit adjusted inside the",
            "jacket, Disposable, lightweight and washable",
            "Centre front closure with full length water repellant zipper",
            "Interior quilt lining with added coverage on the back",
            "Armpit vents for ventilation",
            "Detachable and toggle adjustable hood",
            "Velcro® adjustable cuff tabs",
            "Connectivity : Bluetooth 5.3",
            "Heating electrical power : 18W max",
            "09",
            "midassafety.com",
            "HI-VIS ILLUMINER TECH JACKET"
        ],
        "fabrics": [
            "Shell fabric: 63% Cotton, 34% Polyester, 3% EOL 275gsm| 8.1 oz",
            "Quilting: 100% Polyester 120 gsm | 3.5 oz",
            "Shell fabric: 100% FR Recycled polyester PU coated, 200 GSM",
            "Lining: 100% Meta-aramid, 235 GSM",
            "07",
            "midassafety.com",
            "08",
            "midassafety.com",
            "ARDOR ADVANCE TECH JACKET",
            "Shell fabric: 94% Polyester, 6% Spandex TPU Softshell Fleece",
            "240gsm|7.1oz",
            "Quilting: 100% Polyester, 2x3. 120gsm | 3.5oz",
            "Shell fabric: 100% Polyester Tricot Hi-Vis Orange, 220 GSM",
            "Contrast: 100% Polyester +TPU 150"
        ]
    },
    {
        "id": 12,
        "name": "ANGOLA TROUSERS",
        "description": "",
        "features": [
            "Trousers made up of blend of organic cotton, T400 & stretch",
            "with UPF50+ protection shield",
            "2-way nylon stretch fabric and branded CORDURA® reinforce-",
            "ments Buttoned Fly",
            "Extra wide detachable Holster pockets with zipper; multiple",
            "compartments for tools and additional zipped pocket for coins",
            "Front leg pockets with zippers for mobile and other accessories",
            "Cordura reinforced Knee panels for durability and high abrasion",
            "resistance",
            "50",
            "midassafety.com",
            "NYCO TOUGH-INDUSTRIAL JACKET",
            "DUAL INDUSTRIAL JACKET",
            "Multi Purpose, Functional Bellow zip pockets at Front and Arm",
            "sides",
            "Detachable, Hood Classic Zip opening at the front placket",
            "Sleeve Pocket with Velcro adjustable cuffs",
            "Classic Zip opening , finished with logo tag",
            "High cotton content for comfort and breathability",
            "Authentic look of classic woven cotton",
            "Water repellant",
            "Multipurpose Bellow zip pockets at Front",
            "Detachable, Fur Hood",
            "Classic Zip opening at the front placket with finished logo tag",
            "High cotton content for comfort",
            "Authentic look of classic woven cotton",
            "Double layered vest in contrasting colors",
            "Quilt attached",
            "51",
            "midassafety.com",
            "BINARY CONVERTIBLE PANTS",
            "Oil and water repellent",
            "Zip off convertible shorts",
            "Stretchable Cordura for ease of movement",
            "Zipper leg opening",
            "Hook/Loop attached to waist",
            "Multiple pockets",
            "Reinforcement",
            "Two front and two side pockets",
            "52",
            "midassafety.com",
            "NORD JACKET",
            "hunting and fishing industry.",
            "Utility inspired Front pockets and dropped shoulder and wide boxy",
            "fit reflects a 80’s/90’s aesthetic sense while keeping movement in",
            "mind. E"
        ],
        "fabrics": [
            "Stout craftsman trousers with drop crotch and tapered legs. The trouser",
            "comes with Stretch panel in the waist & calf for comfortable movement.",
            "94% Cotton, 4% Polyester 2% Stretch, 220gsm|6.5oz",
            "Our Dual industrial-jacket is perfect for any worksite. Featuring jacket",
            "made of sturdy Cotton Poly blend fabric that can keep up with the",
            "toughness you need to take on a rugged workday. Multi Pocket with",
            "added vest engineers’ extra durability right where you need it most.",
            "Hard work comes easy in our Nyco Tough-Jacket . Workwear transforms",
            "the classic work apparel by utilizing advanced fabrics, reinforced",
            "stitching and ergonomically designed gussets. Our Nyco Jackets are built",
            "with a nylon cotton blend fabric that is water repellent, stain resistant",
            "and compact in size to get work done easily. It features reinforced elbow",
            "patches, wide gusseted armpits, hidden button-down collar and angled",
            "pockets for easy access.",
            "Shell: 65% Cotton, 35% Polyester 200gsm|9.4oz",
            "Quilting: 100% Polyester 2x3 110gsm|3.2oz",
            "60% Cotton, 40% Nylon tufted 260gsm|7.7oz",
            "Our Binary convertible pants have zip-off legs to make it easy to",
            "switch between trousers and shorts. Carry for the weather with these",
            "quick dry zip-off cargo pants/shorts. They keep you warm, protected",
            "and dries out quickly if it gets wet. These high-rated convertible pants/",
            "shorts are flexible to work in variety of conditions. Pair them with other",
            "cold-weather outerwear to keep your full body warm.",
            "Besides being easy to convert from trousers to shorts they have",
            "several features that will make them a staple of your workwear",
            "uniform. The ankle cuffs are adjustable with zippers which makes them",
            "easy to put on and take off without removing your shoes. The material",
            "at the knees, ankles and seat is stretchable and suited for different",
            "postures. The trousers have one back pocket, two front pockets with",
            "zips and one zipped leg pocket.",
            "Shell: 65% recycled polyester , 35% cotton, 200 gsm | 5.9oz",
            "Cordura: 4 way stretch patch on knees: 92% Nylon, 8% Spandex",
            "Our Nord Utility jacket is crafted from proprietary High Shrunk",
            "Nylon and cotton for a durable and lightweight finish. This jacket",
            "is incorporated with Polyamide mesh for breathability with added"
        ]
    },
    {
        "id": 13,
        "name": "ARDOR ADVANCE TECH JACKET",
        "description": "The Ardor Advance Tech jacket offers augmented Heat Sensing technology with a stylish look of a high-performance softshell jacket. This multi-feature, DWR Softshell jacket is made using a durable softshell textile outer with attached quilting to give warmth and protect the wearer in cold working conditions. The integrated smart heating solution has programmable module which can be autoregulated with temperature control sensors. The Jacket has ample storage space through its spacious front pockets providing wearers with a practical selection. The Hi-Vis Illuminer Tech Jacket is a high-performance workwear jacket that provides comfort, ease of movement, and high visibility in low-light conditions. The jacket is made of industrial launderable stretch material and features Smart Led Visibility technology, a programmable module that provides high visibility through smart Textile fabric lightening patches attached to the back and sleeves, which can be controlled through 3 modes for static, motion, and fall detection. The jacket is also Bluetooth-enabled, allowing supervisors to locate workers in case of an emergency. Our Luna Hi-Vis Fleece Jacket is specifically designed to provide female workers with both snug fit and comfort. It is the perfect solution to ensure the wearer remains visible, warm, and comfortable in low visibility and cold temperatures. It features a contrasting hi-vis and navy design, back mesh vents to provide breathability, reflective tape for visibility, two secure side pockets, and a front zipper opening. This must-have Hi-vis fleece jacket gives you the protection you need while looking stylish. The Hi-Vis Poly Mesh Break-Away Vest is designed to increase worker safety and visibility in low-light conditions. Made of DWR fabric with silver reflective tapes and front pockets, this ultra-lightweight vest can be easily worn over basic workwear.",
        "features": [
            "Therien Heat sensing autoregulated module",
            "Battery and heating element Included",
            "Unique system: the only heated clothing kit adjusted inside the",
            "jacket, Disposable, lightweight and washable",
            "Centre front closure with full length water repellant zipper",
            "Interior quilt lining with added coverage on the back",
            "Armpit vents for ventilation",
            "Detachable and toggle adjustable hood",
            "Velcro® adjustable cuff tabs",
            "Connectivity : Bluetooth 5.3",
            "Heating electrical power : 18W max",
            "09",
            "midassafety.com",
            "HI-VIS ILLUMINER TECH JACKET",
            "Centre front closure with full-length DWR zipper",
            "Detachable and toggle adjustable hood",
            "Velcro adjustable cuff",
            "Autoregulated sensors & and manual mode to optimize jacket",
            "temperature",
            "Heating autonomy: 8h",
            "Connectivity: Bluetooth 5.3",
            "Heating electrical power: 18W",
            "EATURES: Smart Led Textile patches on sleeves and back",
            "light cycles 3 lighting scenarios: Static detection, Motion",
            "detection, and Fall detection",
            "HI-VISIBILITY",
            "LUNA HI-VIS FLEECE JACKET",
            "Ribbed waist",
            "Snap button closure",
            "Reflective tapes",
            "Full-length front zip",
            "Two side zip pockets",
            "Adjustable cuffs",
            "Front zipper placket",
            "Back vent with mesh for ventilation",
            "11",
            "midassafety.com",
            "MOVE HI-VIS SHORTS",
            "MESH HI-VIS VEST",
            "50 mm wide transverse fluorescent hi-visibility strips",
            "Padded shoulder finished with Hanging Hooks",
            "Bellows zip pockets at Vest Front with Pullers",
            "Hanging loops to attach keys or torch",
            "Snap butt"
        ],
        "fabrics": [
            "Shell fabric: 94% Polyester, 6% Spandex TPU Softshell Fleece",
            "240gsm|7.1oz",
            "Quilting: 100% Polyester, 2x3. 120gsm | 3.5oz",
            "Shell fabric: 100% Polyester Tricot Hi-Vis Orange, 220 GSM",
            "Contrast: 100% Polyester +TPU 150D softshell, 250 GSM",
            "Contrast: 100% Recycle Polyester PU membrane -240 GSM",
            "Shell fabric: 60% Polyester, 40% Cotton fleece Hi-Vis, 200 GSM",
            "Contrast: 50% Polyester,50% Cotton fleece, 200 GSM",
            "Lining: 100% Poly Bird Eye Mesh Hi-Vis Yellow",
            "Shell fabric: 100% Polyester mesh Hi-Vis Yellow, 120 GSM",
            "Contrast: 100% Polyester 150D softshell, 220 GSM"
        ]
    },
    {
        "id": 14,
        "name": "AUTO-PORTANT FEMALE COVERALL",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 15,
        "name": "Bennu Coverall",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 16,
        "name": "BINARY CONVERTIBLE PANTS",
        "description": "",
        "features": [
            "Oil and water repellent",
            "Zip off convertible shorts",
            "Stretchable Cordura for ease of movement",
            "Zipper leg opening",
            "Hook/Loop attached to waist",
            "Multiple pockets",
            "Reinforcement",
            "Two front and two side pockets",
            "52",
            "midassafety.com",
            "NORD JACKET",
            "hunting and fishing industry.",
            "Utility inspired Front pockets and dropped shoulder and wide boxy",
            "fit reflects a 80’s/90’s aesthetic sense while keeping movement in",
            "mind. Equipped with mesh lining and easy to open zipper and Velcro",
            "Front placket, this jacket features a Velcro placket with full zip closure",
            "and a stand collar.",
            "Shell: 75% Cotton, 25% Nylon 200gsm|5.9oz",
            "Mesh: 80%Polyamide 20% Elastane",
            "A high-performance hunting and Fishing jacket with Oil and",
            "water repellant finish",
            "Made from Polyamide mesh for breathability",
            "Pocket storage capacity with flap pockets",
            "Front Zipper and Velcro placket",
            "Loose and wide fit",
            "53",
            "midassafety.com",
            "NYCO TOUGH-INDUSTRIAL COVERALL",
            "Multipurpose Bellow zip pockets at Front and Arm sides",
            "Detachable, Hood Classic Zip opening at the front placket",
            "Drawstring  and Toggle adjusted hood and Hem",
            "Sleeve Pocket with Velcro adjustable cuffs",
            "Front zipper closure",
            "HUNTING VEST",
            "Light weight vest",
            "Adjustable shoulder straps",
            "Suspender adjuster with webbing",
            "Adjustable belt in width",
            "Pockets for small objects",
            "Two large front pockets",
            "One back pocket to store tools",
            "54",
            "midassafety.com",
            "DURA SOFTSHELL TROUSER"
        ],
        "fabrics": [
            "Our Binary convertible pants have zip-off legs to make it easy to",
            "switch between trousers and shorts. Carry for the weather with these",
            "quick dry zip-off cargo pants/shorts. They keep you warm, protected",
            "and dries out quickly if it gets wet. These high-rated convertible pants/",
            "shorts are flexible to work in variety of conditions. Pair them with other",
            "cold-weather outerwear to keep your full body warm.",
            "Besides being easy to convert from trousers to shorts they have",
            "several features that will make them a staple of your workwear",
            "uniform. The ankle cuffs are adjustable with zippers which makes them",
            "easy to put on and take off without removing your shoes. The material",
            "at the knees, ankles and seat is stretchable and suited for different",
            "postures. The trousers have one back pocket, two front pockets with",
            "zips and one zipped leg pocket.",
            "Shell: 65% recycled polyester , 35% cotton, 200 gsm | 5.9oz",
            "Cordura: 4 way stretch patch on knees: 92% Nylon, 8% Spandex",
            "Our Nord Utility jacket is crafted from proprietary High Shrunk",
            "Nylon and cotton for a durable and lightweight finish. This jacket",
            "is incorporated with Polyamide mesh for breathability with added",
            "Hard work comes easy in our Nyco Tough-coverall . This technical",
            "coverall is purpose built to be worn while conducting direct action",
            "tasks. Its Fit achieves two-piece mobility with a full range of",
            "unrestricted movement.  This coverall is built with a nylon cotton blend",
            "enable comfort in getting the work done. It features reinforced elbow",
            "patches, two Hollister pockets and elasticated waist.",
            "60% Cotton, 40% Nylon tufted 260gsm|7.7oz",
            "Our canvas hunting vest is a featured piece to carry on fishing or",
            "hunting. It is made of canvas fabric with edges adjusted with belts and",
            "suspender which go with the shoulder straps that can be adjusted in",
            "length to meet different outdoor needs.",
            "100% cotton 240gsm|7oz",
            "Our DWR softshell ,fleece bonded Dura trousers are designed for",
            "weather protection, freedom of movement and breathability. The",
            "knees are protected by CORDURA® patch: a strong, light weight,",
            "rugged and hardwearing waterproof fabric which allows you",
            "to move dynamically in comfort, with little restriction. It is ideal",
            "for protection from high-exertion working in challenging and",
            "changeable environments. It features fully"
        ]
    },
    {
        "id": 17,
        "name": "BLUEDEN JACKET",
        "description": "Our 8020 shorts are tailored with the best cotton material for the comfort of wearer. Our Blue Stylish Denim Jacket with cotton elastane provides comfort during your daily work. It has button closure and has relaxed fit. Experience unparalleled comfort and performance with our classic work polo. Featuring a cut-and-sew design with contrasting piping, this polo offers exceptional moisture management and breathability. The lightweight mesh with contrasting fabric vents moisture, preventing buildup and keeping the wearer cool and comfortable throughout the work shift. Experience unparalleled comfort and performance with our classic pants designed to keep you comfortable and confident on the job. With durable materials, reinforced stitching, and multiple pockets for essential tools, these pants are built to withstand the demands of your daily routine. Whether you’re in healthcare, hospitality, or retail, our pants offer the perfect combination of style, function, and durability. Our 1020 shirt is a plain working shirt essential for your wardrobe. It is both smart and casual.  It features useful chest pockets and button-down collar for added detail. Our two-piece medical scrub for men is a great option for healthcare professionals who want to look stylish and professional. The eco-friendly scrub set features a unique triple-stitch design that enhances your appearance without compromising functionality. The V-neck top comes with multiple pockets, making it easy for you to access your essentials. The pants offer comfortable movement and flexibility for long shifts. Whether you’re a doctor, nurse, or any other healthcare professional, our two-piece medical scrub for men is the perfect choice to help you look and feel your best while at work. RUHE SCRUBS SET",
        "features": [
            "Front closure with stud button over.",
            "Two side pockets",
            "Two front pockets with flaps",
            "Adjustable cuffs",
            "Zip fly",
            "Cotton poly material",
            "Side bellow pockets",
            "VANTGUARD POLO SHIRT",
            "CLASSIC SERVICES PANTS",
            "Classic straight-fit",
            "Back flap pockets",
            "Best for services industry",
            "Two side pockets",
            "Contrast side seams",
            "Underarms elbow vents",
            "Contrasting piping detail",
            "Contrast side vents",
            "Two button placket",
            "Arm cut & sew in hi-vis contrast piping",
            "79",
            "midassafety.com",
            "Shell Fabric: 65% Cotton, 35% Polyester, 200 GSM",
            "Shell Fabric: 65% Cotton, 35% Polyester Ripstop, 240 GSM",
            "80",
            "midassafety.com",
            "1020 SHIRT",
            "Button down closure",
            "Two front pockets with flaps.",
            "Adjustable cuffs",
            "HEALTH",
            "CARE",
            "ECO-BLUE SCRUBS SET",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "Darted front seams with multiple pockets",
            "Multiple bottom pockets",
            "82",
            "midassafety.com",
            "FRIEDEN SCRUBS SET"
        ],
        "fabrics": [
            "cotton 80%, polyester 20% 245 GSM",
            "98% Cotton, 2% Elastane Denim 270 gsm|8oz",
            "100% cotton 200 gsm|5.9oz",
            "Shell: 81.5% PIW Cotton, 17.5% Reprieve Polyster, 1% Elastane, 340 GSM",
            "Our Men’s Casual Two-Piece Denim Medical Scrub is perfect for healthcare",
            "professionals who want to look and feel their best at work. This eco-friendly",
            "set features a unique triple-stitch design that adds a touch of style without",
            "compromising on professionalism. The V-neck top has multiple pockets",
            "that make it easy to access your essentials, while the pants are designed",
            "for comfort and mobility, allowing you to move with ease during long shifts.",
            "Whether you’re a doctor, nurse, or any other healthcare professional, this",
            "scrub will give you the confidence you need to perform your job with ease.",
            "Add a touch of excitement to your hectic workday with our Two-Tone",
            "Medical Scrub. This flattering-fit set features a V-neck and short sleeves",
            "for a stylish and professional look. The matching pants have an elastic",
            "waist for long-lasting comfort during your shift.",
            "Whether you’re a doctor, nurse, or other healthcare professional, our",
            "Tw"
        ]
    },
    {
        "id": 18,
        "name": "BRISKLY RIDER JACKET",
        "description": "The Briskly Rider Jacket is specifically designed to keep riders safe and protected while on the road. Its Kevlar shell provides exceptional protection for the elbows and shoulders and is reinforced with CE approved padding to prevent injuries in case of a fall. The jacket’s Kevlar shell also acts as a protective barrier between the rider’s skin and the road surface in case of an accident where the rider or pillion passenger falls from the motorcycle and slides along the road. For added comfort and protection, the jacket features a knitted 100% Meta-Aramid lining that offers excellent thermal stability, flame resistance, electrical insulation, chemical stability, and radiation resistance. Our workwear cargo pants are made from recycled polyester and cotton, making them both sustainable and durable. They are also designed with large side pockets for convenience and a knee 4-way stretch patch for unrestricted movement. These pants are perfect for working in outdoor, sunny work environments, and will help you perform your best. Our Nami Hybrid Fleece and Quilting Women’s Jacket features a range of versatile features and a sleek design, this jacket is the perfect choice for females in services industries to stay comfortable and warm while working. Constructed from durable ripstop polyester, it can withstand wind and tears, while the dirt-repellent woven surface ensures a professional appearance. The overlapping quilted pocket at the back and breathable materials make it effortless to tackle rain, mud, and dirt without feeling weighed down or uncomfortable.",
        "features": [
            "Durable and strong fabric materials",
            "Puncture resistant",
            "Kevlar and Knitted Meta Aramid jacket",
            "Side zipper openings for ease in carrying it off",
            "Front DWR Zipper placket opening",
            "3 front spacious pockets",
            "Spacious, multi-purpose zipper plain pocket",
            "AA tear and abrasion resistance rating",
            "3 spacious front and one back pocket for storage",
            "Straight High neck collar",
            "42",
            "midassafety.com",
            "TITAN WORK PANTS",
            "Straight fit",
            "4-Way stretch panel",
            "Snap button flap cargo pockets",
            "Recycled material fabric",
            "HI-VIS FLEECE JACKET",
            "DWR zippers",
            "Elasticated cuffsDrawcord adjusted hem",
            "Back storage pocket",
            "Detachable hood",
            "Soft fleece hood with drawcords for additional warmth",
            "Reflective piping",
            "Zipped hand pockets with soft pocket bag lining",
            "Made from durable ripstop polyester to combat wind & tear",
            "43",
            "midassafety.com",
            "44",
            "midassafety.com",
            "MAVEN UTILITY CARGO",
            "PANTS",
            "Cordura knee front",
            "Ample storage pockets",
            "Ruler pocket",
            "Loops for hanging tools",
            "Reinforced Cordura",
            "Breathable and comfortable fit",
            "DENIM WORK PANTS"
        ],
        "fabrics": [
            "Shell: 83% Nylon, 12% Kevlar, 5% Elastane, 300GSM",
            "Lining: 100% Para-Aramid, 270 GSM",
            "Shell: 65% recycled-polyester ,35%Cotton, 245 GSM",
            "Contrast: 4 way-stretch, 92% Nylon, 8% Spandex, 250 GSM",
            "Shell: 100% ripstop Polyester quilt, 280 GSM",
            "Contrast: 80% Cotton, 20% Polyester, Fleece, 280 GSM",
            "Lining: Solid Single Jersey, 100% Cotton, 150 GSM",
            "Our Maven Utility Cargo Pants are made of cotton-poly duck",
            "weave fabric, which is both versatile and durable. Crafted with",
            "multiple pockets and double-layered knees for extra protection,",
            "these pants are built to last and can handle rugged tasks, whether",
            "you’re working on a construction site or off the worksite.",
            "Shell: 68% Polyester, 29% Cotton, 3% Lycra Panama Brown, GSM 280",
            "Contrast: 100% Nylon Cordura 500x500D 1/1 Canvas",
            "These sustainable denim work trousers are the perfect choice for",
            "everyday tasks or for those in the service industry. With a clean overall",
            "appearance and internal pockets, these pants are designed for eco-",
            "conscious workers who want a professional and functional look.",
            "Made from sustainable materials, these pants are both durable and",
            "comfortable. The slim-fit design ensures freedom of movement and",
            "safety, even in intense work situations.",
            "Shell: 73% Cotton, 17% Hemp, 8%"
        ]
    },
    {
        "id": 19,
        "name": "CHAINSAW BIB PANTS",
        "description": "",
        "features": [
            "Metal D-ring to keep essential items readily accessible",
            "Ideal for Forestry, Logging, Construction, Glass industry, Agriculture",
            "Reflective details",
            "Cut resistant padding on thigh and knee - TPE-3140, 135G/SQM+-",
            "10G, CW 132CM+-2CM (PP technology surfaces)",
            "Elastic shoulder straps with quick-fastening buckles",
            "Stretch crotch panel for ease of movement",
            "Bib pocket - Back elasticated waistband and adjustable waist",
            "Two patch pockets with bottom reinforcement",
            "Side Button opening",
            "Class 2 layer – 8 layers ( EN ISO 11393-2 type A, B and C)",
            "Shell: 65% Polyester 35% Cotton  - 260 GSM",
            "Inside Layers: 100% Polyester mesh – 120 GSM",
            "88",
            "midassafety.com",
            "2TONE-CHAINSAW BIB PANTS",
            "Metal D-ring to keep essential items readily accessible",
            "Ideal for Forestry, Logging, Construction, Glass industry,",
            "Agriculture",
            "Reflective details",
            "Cut resistant padding on thigh and knee - TPE-3140, 135G/",
            "SQM+-10G, CW 132CM+-2CM (PP technology surfaces)",
            "Elastic shoulder straps with quick-fastening buckles",
            "Bib pocket - Back elasticated waistband and adjustable waist",
            "Two patch pockets with bottom reinforcement",
            "Back pocket with flap and Velcro",
            "Shell: 65% Polyester 35% Cotton  - 260 GSM",
            "Inside Layers: 100% Polyester mesh – 120 GSM",
            "89",
            "midassafety.com",
            "SUSTAINABLE FABRIC OPTIONS",
            "Below are the most commonly used safety clothing fabrics from our offerings:",
            "LIGHTWEIGHT SUSTAINABLE FABRICS",
            "REI001",
            "MD752G",
            "MD763G",
            "65% organic cotton,",
            "35% tencel",
            "Recycled polyester 86.5%",
            "LYCRA, 6% Spandex, 7.5%",
            "65% rPes polyester, 35%",
            "organic cotton",
            "55% Recycled Polyester,",
            "35% Organic cotton, 10%",
            "Tencel, 200 GSM",
            "67% Organic cotton",
            "30%Tencel, 3%spandex",
            "200 Gsm",
            "90",
            "midassafety.com",
            "SUSTAINABLE FLEECE FABRIC",
            "FR RECYCLED /SUSTAINABLE FABRICS",
            "65% BCI Cotton, 35% Recycled Polyester fleece,",
            "200 GSM",
            "Recycled polyester/FR PU",
            "Recycled polyester/FR PU/Cotton",
            "Recycled polyester/PTFE+PU/Aramid",
            "200gsm",
            "200gsm",
            "200gsm",
            "145cm",
            "145cm",
            "145cm",
            "EN11612/GB8965.1/AS1906/EN1149-3",
            "EN11612/GB8965.1/AS1906/EN1149-3",
            "AS1906/EN343 3-3",
            "Poly-Naia (70:30) Grey - Fleece   |   200-230   |   6.80   |   3m/KG",
            "ZFE036",
            "ZFE089",
            "COMPOSITION",
            "COMPOSITION",
            "COMPOSITION",
            "WEIGHT",
            "WEIGHT",
            "WEIGHT",
            "WIDTH",
            "WIDTH",
            "WIDTH",
            "PERFORMANCE",
            "PERFORMANCE",
            "PERFORMANCE",
            "91",
            "midassafety.com",
            "SUSTAINABLE WORKWEAR FABRICS",
            "45%Repreve Recycle Polyester",
            "44%Polyester 11%Elastane",
            "240 GSM",
            "65% recycled-polyester, 35%",
            "Cotton, 245 GSM",
            "Navy FR RECYCLED CVC TWILL-",
            "280GSM",
            "Modacrylic/Tencel/Carbon",
            "230gsm",
            "92% Recycle Nylon, 18% Spandex,",
            "400 GSM",
            "92",
            "midassafety.com",
            "HI-VIS SUSTAINABLE FABRIC",
            "60%Protex C,39%Tencel",
            ",1%Antistatic 180-220 GSM",
            "62% Recycled polyester",
            "21% organic cotton  17%",
            "Polyester 255 GSM",
            "50% Lyocell, 50% Polyester",
            "270GSM",
            "Protex C, Lenzing FR, Para",
            "aramid, Tencel 290 GSM",
            "Hi vis orange recycled",
            "polyester with FR PU +PTFE",
            "lamination 200 GSM",
            "68% Recycled polyester",
            "32% Elastomultiester",
            "210 GSM",
            "50% Lyocell, 50% Polyester",
            "270GSM",
            "40% Protex C,30% Lenzing",
            "FR, 23% TENCEL, 5% Para",
            "aramid, 2%Antistatic",
            "170 GSM",
            "Hi vis yellow antistatic",
            "recycled polyester with FR",
            "PU coating 240 GSM",
            "65% Polyester 35% Tencel",
            "2/1 Twill  250 GSM",
            "Recycled polyester/FR PU,",
            "200GSM",
            "93",
            "midassafety.com",
            "SUSTAINABLE TRIMS OPTIONS",
            "ZIPPERS",
            "BUCKLE",
            "LYCRA ELASTIC 25MM",
            "FUSING",
            "Recycled-4.0 GRS",
            "Certified Golden brass",
            "CE DA zipper",
            "GRS Certified -Sus-",
            "tainable Buckle",
            "Elastic Lycra Latex",
            "free-25mm white Re-",
            "cycled"
        ],
        "fabrics": [
            "Designed with the specific needs of tree care professionals in mind, our",
            "Chainsaw Overalls offer unparalleled protection against chainsaw-related",
            "injuries. These bib pants are constructed from heavy-duty, cut-resistant",
            "materials that can withstand the force of a chainsaw blade, providing you",
            "with peace of mind while working with sharp blades or hazardous conditions.",
            "Our latest Chainsaw overalls are a specialized type of workwear",
            "designed to protect tree care professionals and others who use",
            "chainsaws. These pants are made from heavy-duty, cut-resistant",
            "materials that can withstand the force of a chainsaw blade."
        ]
    },
    {
        "id": 20,
        "name": "Classic Bib Canvas overall",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 21,
        "name": "CLASSIC SERVICES PANTS",
        "description": "Experience unparalleled comfort and performance with our classic work polo. Featuring a cut-and-sew design with contrasting piping, this polo offers exceptional moisture management and breathability. The lightweight mesh with contrasting fabric vents moisture, preventing buildup and keeping the wearer cool and comfortable throughout the work shift. Experience unparalleled comfort and performance with our classic pants designed to keep you comfortable and confident on the job. With durable materials, reinforced stitching, and multiple pockets for essential tools, these pants are built to withstand the demands of your daily routine. Whether you’re in healthcare, hospitality, or retail, our pants offer the perfect combination of style, function, and durability. Our 1020 shirt is a plain working shirt essential for your wardrobe. It is both smart and casual.  It features useful chest pockets and button-down collar for added detail. Our two-piece medical scrub for men is a great option for healthcare professionals who want to look stylish and professional. The eco-friendly scrub set features a unique triple-stitch design that enhances your appearance without compromising functionality. The V-neck top comes with multiple pockets, making it easy for you to access your essentials. The pants offer comfortable movement and flexibility for long shifts. Whether you’re a doctor, nurse, or any other healthcare professional, our two-piece medical scrub for men is the perfect choice to help you look and feel your best while at work. RUHE SCRUBS SET",
        "features": [
            "Classic straight-fit",
            "Back flap pockets",
            "Best for services industry",
            "Two side pockets",
            "Contrast side seams",
            "Underarms elbow vents",
            "Contrasting piping detail",
            "Contrast side vents",
            "Two button placket",
            "Arm cut & sew in hi-vis contrast piping",
            "79",
            "midassafety.com",
            "Shell Fabric: 65% Cotton, 35% Polyester, 200 GSM",
            "Shell Fabric: 65% Cotton, 35% Polyester Ripstop, 240 GSM",
            "80",
            "midassafety.com",
            "1020 SHIRT",
            "Button down closure",
            "Two front pockets with flaps.",
            "Adjustable cuffs",
            "HEALTH",
            "CARE",
            "ECO-BLUE SCRUBS SET",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "Darted front seams with multiple pockets",
            "Multiple bottom pockets",
            "82",
            "midassafety.com",
            "FRIEDEN SCRUBS SET",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "2 side pockets",
            "Straight-fit trousers",
            "Multiple bottom pockets",
            "Lightweight and long-lasting",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "2 side pockets",
            "Straight-fit trousers",
            "83",
            "midassafety.com",
            "Shell:  65% Polyester, 35% Cotton, 2/1 Twill, 160 GSM",
            "CUT",
            "RESISTANT",
            "85",
            "midassafety.com",
            "CUT RESISTANT-SWEATS"
        ],
        "fabrics": [
            "100% cotton 200 gsm|5.9oz",
            "Shell: 81.5% PIW Cotton, 17.5% Reprieve Polyster, 1% Elastane, 340 GSM",
            "Our Men’s Casual Two-Piece Denim Medical Scrub is perfect for healthcare",
            "professionals who want to look and feel their best at work. This eco-friendly",
            "set features a unique triple-stitch design that adds a touch of style without",
            "compromising on professionalism. The V-neck top has multiple pockets",
            "that make it easy to access your essentials, while the pants are designed",
            "for comfort and mobility, allowing you to move with ease during long shifts.",
            "Whether you’re a doctor, nurse, or any other healthcare professional, this",
            "scrub will give you the confidence you need to perform your job with ease.",
            "Add a touch of excitement to your hectic workday with our Two-Tone",
            "Medical Scrub. This flattering-fit set features a V-neck and short sleeves",
            "for a stylish and professional look. The matching pants have an elastic",
            "waist for long-lasting comfort during your shift.",
            "Whether you’re a doctor, nurse, or other healthcare professional, our",
            "Two-Tone Medical Scrub is the perfect choice for those who want to look",
            "and feel their best while on the job.",
            "Shell:  50% Cotton, 50% Polyester, 190 GSM"
        ]
    },
    {
        "id": 22,
        "name": "CLASSIC TROUSER",
        "description": "Our 8020 Fleece Jacket is one of the instant favorite sweatshirt. It is a tailored fit with  warm and cozy feel for the wearer. Our classic trousers have been designed to meet formal work environments, get ready to look stylish and feel great with our comfortable industrially launderable polycotton fabric for optimum durability in its class. Our 8020 shorts are tailored with the best cotton material for the comfort of wearer. Our Blue Stylish Denim Jacket with cotton elastane provides comfort during your daily work. It has button closure and has relaxed fit. Experience unparalleled comfort and performance with our classic work polo. Featuring a cut-and-sew design with contrasting piping, this polo offers exceptional moisture management and breathability. The lightweight mesh with contrasting fabric vents moisture, preventing buildup and keeping the wearer cool and comfortable throughout the work shift. Experience unparalleled comfort and performance with our classic pants designed to keep you comfortable and confident on the job. With durable materials, reinforced stitching, and multiple pockets for essential tools, these pants are built to withstand the demands of your daily routine. Whether you’re in healthcare, hospitality, or retail, our pants offer the perfect combination of style, function, and durability. Our 1020 shirt is a plain working shirt essential for your wardrobe. It is both smart and casual.  It features useful chest pockets and button-down collar for added detail. Our two-piece medical scrub for men is a great option for healthcare professionals who want to look stylish and professional. The eco-friendly scrub set features a unique triple-stitch design that enhances your appearance without compromising functionality.",
        "features": [
            "Zip Fastener",
            "Two pockets in the back and two pockets in the front",
            "Coin pocket inside the right front pocket",
            "Zip Fastener",
            "Fleece Material",
            "Adjustable ribbed cuffs",
            "78",
            "midassafety.com",
            "8020 SHORTS",
            "BLUEDEN JACKET",
            "Front closure with stud button over.",
            "Two side pockets",
            "Two front pockets with flaps",
            "Adjustable cuffs",
            "Zip fly",
            "Cotton poly material",
            "Side bellow pockets",
            "VANTGUARD POLO SHIRT",
            "CLASSIC SERVICES PANTS",
            "Classic straight-fit",
            "Back flap pockets",
            "Best for services industry",
            "Two side pockets",
            "Contrast side seams",
            "Underarms elbow vents",
            "Contrasting piping detail",
            "Contrast side vents",
            "Two button placket",
            "Arm cut & sew in hi-vis contrast piping",
            "79",
            "midassafety.com",
            "Shell Fabric: 65% Cotton, 35% Polyester, 200 GSM",
            "Shell Fabric: 65% Cotton, 35% Polyester Ripstop, 240 GSM",
            "80",
            "midassafety.com",
            "1020 SHIRT",
            "Button down closure",
            "Two front pockets with flaps.",
            "Adjustable cuffs",
            "HEALTH",
            "CARE",
            "ECO-BLUE SCRUBS SET",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "Darted front seams with multiple pockets",
            "Multiple bottom pockets",
            "82",
            "midassafety.com",
            "FRIEDEN SCRUBS SET"
        ],
        "fabrics": [
            "80% cotton, 20% Polyester fleece 245 gsm|7.2oz",
            "50% cotton, 50% Polyester peach finished 240 gsm| 7.1oz",
            "cotton 80%, polyester 20% 245 GSM",
            "98% Cotton, 2% Elastane Denim 270 gsm|8oz",
            "100% cotton 200 gsm|5.9oz",
            "Shell: 81.5% PIW Cotton, 17.5% Reprieve Polyster, 1% Elastane, 340 GSM",
            "Our Men’s Casual Two-Piece Denim Medical Scrub is perfect for healthcare",
            "professionals who want to look and feel their best at work. This eco-friendly",
            "set features a unique triple-stitch design that adds a touch of style without",
            "compromising on professionalism. The V-neck top has multiple pockets",
            "that make it easy to access your essentials, while the pants are designed",
            "for comfort and mobility, allowing you to move with ease during long shifts.",
            "Whether you’re a doctor, nurse, or any other healthcare professional, this",
            "scrub will give you the confidence you need to perform your job with ease."
        ]
    },
    {
        "id": 23,
        "name": "Combi suit",
        "description": "",
        "features": [
            "4-Way stretch fabric for movement",
            "Fluorescent contrast color with reflective tapes for visibility",
            "100% Nylon branded Cordura kneepad pockets",
            "Front closure with storm flap and stud fastening",
            "Two front chest pockets and back pockets with flaps",
            "Detachable holster pockets",
            "Press stud fastening on innermost hanging tool pocket",
            "Elasticated waistband with tool strap at both sides of waist",
            "Adjustable shoulder straps with hook and loop",
            "Ventilation in back through 100% polyester tricot mesh fabric",
            "49",
            "midassafety.com",
            "CANVAS CLASSIC BIB AND BRACE",
            "OVERALL",
            "A bib that stays dry all the time",
            "Breathable and water repellent fabric",
            "Relaxed fit with slightly tapered legs and regular waistline",
            "Water repellent Zipper on fly area",
            "Spacious front, side, and back pockets",
            "Loop for hammer",
            "Elasticated strap shoulder adjuster with suspender closure",
            "ANGOLA TROUSERS",
            "Trousers made up of blend of organic cotton, T400 & stretch",
            "with UPF50+ protection shield",
            "2-way nylon stretch fabric and branded CORDURA® reinforce-",
            "ments Buttoned Fly",
            "Extra wide detachable Holster pockets with zipper; multiple",
            "compartments for tools and additional zipped pocket for coins",
            "Front leg pockets with zippers for mobile and other accessories",
            "Cordura reinforced Knee panels for durability and high abrasion",
            "resistance",
            "50",
            "midassafety.com",
            "NYCO TOUGH-INDUSTRIAL JACKET",
            "DUAL INDUSTRIAL JACKET",
            "Multi Purpose, Functional Bellow zip pockets at Front and Arm",
            "sides",
            "Detachable, Hood Classic Zip opening at the front placket",
            "Sleeve Pocket with Velcro adjustable cuffs",
            "Classic Zip opening , finished with logo tag",
            "High cotton content for comfort and breathability",
            "Authentic look of classic woven cotton",
            "Water repellant",
            "Multipurpose Bellow zip pockets at Front",
            "Detachable, Fur Hood",
            "Classic Zip opening at the front placket with finished logo tag",
            "High cotton content for comfort",
            "Authentic look of classic woven cot"
        ],
        "fabrics": [
            "Shell: 98% Cotton, 2% Elastane, 2/2 weave, 245 GSM",
            "Our classic Canvas Bib and Brace Overall provides you the",
            "toughness you need to take on a rugged workday.",
            "Water-repellent and engineered with extra durability right where",
            "you need it most.  For an easy fit, this bib and brace overall features",
            "elastic at the shoulders and waist adjustable to your perfect size.",
            "Designed with 2 front chest pocket and Side Tool pockets.",
            "98%Cotton, 2%Elastane, 2/2 weave 240gsm| 7.1oz",
            "Stout craftsman trousers with drop crotch and tapered legs. The trouser",
            "comes with Stretch panel in the waist & calf for comfortable movement.",
            "94% Cotton, 4% Polyester 2% Stretch, 220gsm|6.5oz",
            "Our Dual industrial-jacket is perfect for any worksite. Featuring jacket",
            "made of sturdy Cotton Poly blend fabric that can keep up with the",
            "toughness you need to take on a rugged workday. Multi Pocket with",
            "added vest engineers’ extra durability right where you need it most.",
            "Hard work comes easy in our Nyco Tough-Jacket . Workwear transforms",
            "the classic work apparel by utilizing advanced fabrics, reinforced",
            "stitching and ergonomically designed gussets. Our Nyco Jackets are built",
            "with a nylon cotton blend fabric that is water repellent, stain resistant",
            "and compact in size to get work done easily. It features reinforced elbow",
            "patches, wide gusseted armpits, hidden button-down collar and angled",
            "pockets for easy access.",
            "Shell: 65% Cotton, 35% Polyester 200gsm|9.4oz",
            "Quilting: 100% Polyester 2x3 110gsm|3.2oz",
            "60% Cotton, 40% Nylon tufted 260gsm|7.7oz"
        ]
    },
    {
        "id": 24,
        "name": "Cover cargo trouser",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 25,
        "name": "Cut Resistant-Grey",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 26,
        "name": "CUT RESISTANT-SWEATSHIRT",
        "description": "",
        "features": [
            "Made up of a blend of Polyester yarn, Glass Fibers, UHMWPE (Ul-",
            "tra High Molecular Weight Polyethylene), Spandex & Coolmax",
            "Jackets & pullovers are made in a 12gg machine while aprons",
            "being made in 7gg machine",
            "Highly breathable and comfortable PPE garment",
            "High neck protection with Coolmax to provide maximum",
            "comfort",
            "Sleeves available in thumb loop and thumbhole",
            "Provided with webbings and lock for improved grip",
            "Protection Levels as Per ASTM – F2992",
            "Pullover: Body (A3), Rib (A6), Interlock & Neck (A7)",
            "Shirts: Body (A3) & Rib (A5)",
            "Aprons: Body (A9)",
            "86",
            "midassafety.com",
            "CUT RESISTANT-SWEATSHIRT",
            "Made up of a blend of Polyester yarn, Glass Fibers, UHMWPE",
            "(Ultra High Molecular Weight Polyethylene), Spandex &",
            "Coolmax",
            "Jackets & pullovers are made in a 12gg machine while",
            "aprons being made in 7gg machine",
            "Highly breathable and comfortable PPE garment",
            "High neck protection with Coolmax to provide maximum",
            "comfort",
            "Sleeves available in thumb loop and thumbhole",
            "Provided with webbings and lock for improved grip",
            "Protection Levels as Per ASTM – F2992",
            "Pullover: Body (A3), Rib (A6), Interlock & Neck (A7)",
            "Shirts: Body (A3) & Rib (A5)",
            "Aprons: Body (A9)",
            "87",
            "midassafety.com",
            "CHAINSAW BIB PANTS",
            "Metal D-ring to keep essential items readily accessible",
            "Ideal for Forestry, Logging, Construction, Glass industry, Agriculture",
            "Reflective details",
            "Cut resistant padding on thigh and knee - TPE-3140, 135G/SQM+-",
            "10G, CW 132CM+-2CM (PP technology surfaces)",
            "Elastic shoulder straps with quick-fastening buckles",
            "Stretch crotch panel for ease of movement",
            "Bib pocket - Back elasticated waistband and adjustable waist",
            "Two patch pockets with bottom reinforcement",
            "Side Button opening",
            "Class 2 layer – 8 layers ( EN ISO 11393-2 type A, B and C)",
            "Shell: 65% Polyester 35% Cotton  - 260 GSM",
            "Inside Layers: 100% Polyester mesh – 120 GSM",
            "88",
            "midassafety.com",
            "2TONE-CHAINSAW BIB PANTS",
            "Metal D-ring to keep essential items readily accessible",
            "Ideal for Forestry, Logging, Construction, Glass industry,",
            "Agriculture",
            "Reflectiv"
        ],
        "fabrics": [
            "33% UHMWPE, 58% Nylon, 8% Glass, 1% Spandex",
            "35% UHMWPE, 30% Polyester, 2% Spandex, Coolmax",
            "Midas Cut Resistant Clothing is designed to provide protection to workers",
            "in the glass, industrial manufacturing, and food processing industries. It",
            "provides protection to the body to mitigate the risk of cut injuries while being",
            "comfortable in workshops and industrial environments.",
            "Our Cut Resistant clothing has a wide range of products including pullovers,",
            "aprons, chaps and sleeves conforming from A3 to A9 levels of protection",
            "classes.",
            "Garments are made up of breathable Coolmax technology to provide",
            "comfort.",
            "Midas Cut Resistant Clothing is designed to provide protection to",
            "workers in the glass, industrial manufacturing, and food processing",
            "industries. It provides protection to the body to mitigate the risk of",
            "cut injuries while being comfortable in workshops and industrial",
            "environments.",
            "Our Cut Resistant clothing has a wide range of products including",
            "pullovers, aprons, chaps and sleeves conforming from A3 to A9 levels of",
            "protection classes.",
            "Garments are made up of breathable Coolmax technology to provide",
            "comfort.",
            "33% UHMWPE, 58% Nylon, 8% Glass, 1% Spandex",
            "35% UHMWPE, 30% Polyester, 2% Spandex, Coolmax",
            "Designed with the specific needs of tree care professionals in mind, our",
            "Chainsaw Overalls offer unparalleled protection against chainsaw-related",
            "injuries. These bib pants are constructed from heavy-duty, cut-resistant",
            "materials that can withstand the force of a chainsaw blade, providing you",
            "with peace of mind while working with sharp blades or hazardous conditions.",
            "Our latest Chainsaw overalls are a specialized type of workwear",
            "designed to protect tree care professionals and others who use",
            "chainsaws. These pants are made from heavy-duty, cut-resistant",
            "materials that can withstand the force of a chainsaw blade."
        ]
    },
    {
        "id": 27,
        "name": "DENIM WORK PANTS",
        "description": "",
        "features": [
            "Drawcord adjusted side pockets to store the tools",
            "Front pockets with webbing",
            "Cordura knee pad pocket with side-hidden zipper",
            "Side cargo pocket",
            "Webbing on the pockets with the DR-Ring",
            "4way stretch gusset",
            "Articulated, Reinforced Cordura at the bottom",
            "ECO TERRAIN WORK PANTS",
            "DURA TOUGH-INDUSTRIAL",
            "TROUSER",
            "D-Ring webbing and a pouch pocket at the front",
            "Contrasting Hi-Vis yellow",
            "Straight lightweight pants",
            "Reflective tapes",
            "4way stretch gusset",
            "Flap pockets",
            "5cm reflective tapes",
            "Multiple storage pockets",
            "Detachable Holster pockets",
            "EN 14404 compliant Kneepads",
            "knee pad pouch for a padding insert.",
            "45",
            "midassafety.com",
            "46",
            "midassafety.com",
            "HYBRID DENIM JACKET",
            "Recycled zippers and fabric materials",
            "Detachable, softshell Zip on and off-sleeves",
            "Breathable and comfortable fit",
            "Ribbed cuffs and Hem",
            "Zipper placket",
            "Lined with recycled interlock lining",
            "Tobacco thread stitches  with ribbed cuffs and hem",
            "INGRESS COVERALL"
        ],
        "fabrics": [
            "These sustainable denim work trousers are the perfect choice for",
            "everyday tasks or for those in the service industry. With a clean overall",
            "appearance and internal pockets, these pants are designed for eco-",
            "conscious workers who want a professional and functional look.",
            "Made from sustainable materials, these pants are both durable and",
            "comfortable. The slim-fit design ensures freedom of movement and",
            "safety, even in intense work situations.",
            "Shell: 73% Cotton, 17% Hemp, 8% Enastomultiester, 2% Elastane, 280 GSM",
            "Contrast: 4way stretch, 92% Nylon, 08% Spandex, 250 GSM",
            "Contrast: 92% Nylon, 08% Spandex, 250 GSM",
            "The Dura Tough Industrial Pant is the perfect choice for workers who",
            "need a durable and comfortable pant with high visibility features. Made",
            "from 100% polyester with Hi-vis accents, these pants are designed for",
            "comfort, flexibility, and freedom of movement.",
            "With a classic straight fit, articulated knees, and durable fabric, the Dura",
            "Tough Industrial Pant is perfect for tough job sites. The high-visibility",
            "patch and reflective tape make workers more visible in low-light",
            "conditions, helping to keep them safe.",
            "Our Eco-Terrain work pants are designed for outdoor fieldwork and",
            "provide the perfect fit. Kneeling during work can be strenuous on the",
            "body and knees, which is why our pants offer the ideal solution with",
            "knee protection and a stretch gusset. The ergonomic fit ensures comfort",
            "and protection throughout the workday. These pants are versatile and",
            "equipped with tool, cargo, ruler, and back pockets. They are crafted with",
            "a blend of Tencel and recycled materials, making them a sustainable",
            "and comfortable option.",
            "Shell Fabric: 100% Polyester, pongée TPU, 160 GSM",
            "Contrast: Hi-Vis, 100% Polyester, 200 GSM",
            "Contrast: 4 way-stretch, 92% Nylon, 8% Spandex, 250 GSM",
            "Shell: 65% Polyester, 35%Tencel, 2/1 Twill, 250 GSM",
            "Contrast: 65% Recycled, 35% Tencel, 2/1 Twill, 245 GSM",
            "Contrast: 92% Nylon, 8% Spandex",
            "Our new Hybrid Denim Jacket is the perfect blend of sustainable",
            "style and comfort. Made from recycled materials, including viscose",
            "fibers, this jacket is eco-friendly and breathable. The fabric provides",
            "a soft feel on the skin, with air chambers for lightness and moisture",
            "management.",
            "The jacket is designed to be durable, with viscose fibers providing",
            "strength and longevity. It also features detachable Recycled",
            "Softshell sleeves, which can be zipped on or off depending on",
            "the weather. The front bellow pockets offer ample space for your",
            "essentials, while the hybrid recycled fleece bonded softshell fabric",
            "sleeves add a unique touch to the design.",
            "Whether you’re running errands or hitting the gym, the Hybrid Denim",
            "Jacket is the perfect choice for a stylish and sustainable look.",
            "Shell fabric: 70% Cotton, 9% Polyester, 9.5% Viseta, 9.5% Vloft, 2% Lycra,",
            "280 GSM",
            "Lining: 100% Polyester Taffeta, 120 GSM",
            "Sleeves: 92% Recycle Nylon, 18% Spandex, 400 GSM",
            "This durable coveral"
        ]
    },
    {
        "id": 28,
        "name": "DURA SOFTSHELL JACKET",
        "description": "Experience the warmth and style with the Nylon Work Jacket. Crafted with high-quality nylon, this jacket offers exceptional comfort, mobility, and protection against cold weather conditions. With its durable construction and functional design, it is the perfect choice for workers in the construction, patrolling, and mining sectors. The jacket features multiple pockets for storing tools and essentials, and its articulated sleeves allow for a full range of motion. Whether you’re working on a construction site or braving the cold on patrol, the Nylon Work Jacket will keep you warm, comfortable, and protected. jacket that’s easy to pack and suitable for all genders. It’s made from 100% recycled fabric materials with a water-repellent shell fabric and Introducing our Reflective Work Cargo Pants, a contemporary take on the classic cargo pants. These pants feature reflective piping along the front seams and bungee cord speckles on the spacious cargo pockets, keeping you visible and safe in low-light conditions. Additionally, the knee patch is reinforced with Cordura for extra durability when kneeling, and the DWR shell fabric includes stretch elements for unhindered movement. These pants are an excellent choice for outdoor night shift workers, providing warmth, protection, and comfort on the job. Are you in need of durable and eco-friendly pants for chilly outdoor work? Look no further than our Eco Armor pants! These multipurpose pants are designed to offer warmth and moisture resistance in cold work environments. They are also environmentally conscious, made with recycled fleece-bonded softshell and Cordura at the knees, as well as DWR technology. For additional protection, pair them with our EnviroArmor jacket. Make your outdoor tasks effortless and stylish with our Eco Armor pants.",
        "features": [
            "Breathable waterproof fabric",
            "Extended fit  and length",
            "Zipper and Velcro at front placket",
            "Water-repellant zippers",
            "High neck collar",
            "Detachable hood",
            "4 front spacious pocket",
            "DWR-Zipper opening at trouser hem for ease of wearing",
            "61",
            "midassafety.com",
            "NYLON WORK JACKET",
            "100% Gabardine nylon",
            "Quilting inside",
            "DWR shell fabric",
            "Removeable hood",
            "Front pockets",
            "Boxy and slightly cropped fit",
            "STALWART WINDBREAKER",
            "with drawstring and velcro details to lock in warmth at the hem and",
            "cuffs, and it’s soft to the touch, versatile, and great for layering. With",
            "segmented reflective tapes, it keeps the wearer visible, and it also has",
            "detachable bag pocket options.",
            "Spacious bellow pocket",
            "Bag pockets at the back for carrying additional essentials",
            "Cut and sew details",
            "Segmented tapes to keep the wearer visible",
            "Mesh vents at the front and back",
            "Cuff adjusters at Sleeve",
            "LUMIA REFLECTIVE CARGO PANTS",
            "Cordura Knee pad",
            "DWR Shell fabric",
            "Straight and sleek fit pants",
            "Reflective piping",
            "4way stretch gusset",
            "Flap Cargo pockets",
            "Multiple pockets for storage",
            "62",
            "midassafety.com",
            "63",
            "midassafety.com",
            "ENVIROARMOR PANTS:"
        ],
        "fabrics": [
            "Our DWR softshell fleece bonded Dura Softshell jacket is an ideal",
            "pick for workers performing outdoor tasks in cold environments. The",
            "Dura Softshell jacket is designed to offer, freedom of movement and",
            "breathability while withstanding the rigors of rain and wind. The stretch",
            "in the shell fabric provides unrestricted movement.",
            "Shell: 100% Elasticated Polyester TPU, 300 GSM",
            "Shell: 100% Gabardine Nylon, 300 GSM",
            "Lining: 100% Polyester Quilting, 200 GSM",
            "Shell Fabric: 100% Polyester, 150x150D 2/2 Twill TPU, 170 GSM",
            "Contrast: 100% Elasticated Polyester TPU, 300 GSM",
            "Contrast: 82% Recycled Nylon, 18% Spandex PU membrane, Recycled",
            "stretch fleece, 400 GSM",
            "Shell Fabric: 100% Polyester TPU Softshell, 220 GSM",
            "Shell fabric: 82% Recycle Nylon, 18% Spandex PU membra"
        ]
    },
    {
        "id": 29,
        "name": "Dura softshell Trouser",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 30,
        "name": "Dura tough-Industrial trouser",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 31,
        "name": "DURO 2TONE INDUSTRIAL PANT",
        "description": "The Military Utility Jacket is an ideal field jacket that was originally designed as a practical outer layer for military personnel to protect them from the elements. Our jacket is highly durable, tear-resistant, and practical to use. It includes a waist adjuster and a hand grip that adds to the convenience of carrying it in the field. This jacket is perfect for outdoor workers. It is made of classic fleece construction and features a quilted water-repellent overlay at the back. Additionally, it comes with an elbow mesh vent that offers breathability, and cozy hand pockets that provide added warmth. The Military Field Jacket is unbeatable in terms of warmth and provides full range of motion, making it ideal for individuals performing on the field. Our new Hybrid Hardshell Jacket combines athleisure with sustainability to create a jacket that is both eco-friendly and functional. Made from recycled materials, this jacket is breathable and perfect for protecting you from rain, wind, or snow during winter patrolling or camping trips. The durable fabric can handle abrasions from rocks, and the recycled jersey lining ensures comfort and warmth. Plus, the detachable Hi-vis yellow softshell sleeves can be easily zipped on and off depending on the weather. With front bellow pockets for keeping your essentials organized and hybrid recycled jersey bonded hardshell sleeves for a unique touch, the Hybrid Hardshell Jacket is a must-have for anyone looking for a sustainable, versatile, and comfortable jacket. Experience the warmth and style with the Nylon Work Jacket. Crafted with high-quality nylon, this jacket offers exceptional comfort, mobility, and protection against cold weather conditions. With its durable construction and fu",
        "features": [
            "Metal D-ring to keep essential items readily accessible",
            "Side pockets with additional phone pocket",
            "Webbing featured tool pockets",
            "Kneepad pockets",
            "Tool pockets",
            "58",
            "midassafety.com",
            "MILITARY FIELD JACKET",
            "Arm vents with mesh-lined",
            "DWR zippers",
            "Soft fleece hood with drawcords for additional warmth",
            "Zipped hand pockets with soft pocket bag lining",
            "WEATHER",
            "PROTECTION",
            "HARDSHELL HYBRID WORK JACKET",
            "Recycled zippers and fabric materials",
            "Detachable, softshell Zip on and off-sleeves",
            "Breathable and comfortable fit",
            "Ribbed cuffs and Hem",
            "Zipper placket",
            "Lined with recycled interlock lining",
            "Tobacco thread stitches  with ribbed cuffs and hem",
            "60",
            "midassafety.com",
            "DURA SOFTSHELL JACKET",
            "Breathable waterproof fabric",
            "Extended fit  and length",
            "Zipper and Velcro at front placket",
            "Water-repellant zippers",
            "High neck collar",
            "Detachable hood",
            "4 front spacious pocket",
            "DWR-Zipper opening at trouser hem for ease of wearing",
            "61",
            "midassafety.com",
            "NYLON WORK JACKET"
        ],
        "fabrics": [
            "The Duro 2Tone Industrial Pant is ideal for workers who need a durable",
            "and comfortable option. With a contrasting grey and black design,",
            "these pants offer exceptional comfort, flexibility, and freedom of",
            "movement. They have a classic straight fit, two tool pockets, Pintucks",
            "at the knee panel, articulated kneepad pockets, and a sturdy fabric,",
            "making them perfect for demanding work environments.",
            "Shell fabric: 65% Cotton, 35% Polyester, 240 GSM",
            "Grey contrast: 65% Cotton, 35% Polyester, 240 GSM",
            "Shell: 100% Polyester-380 GSM",
            "Quilt: 100% Polyester-280 GSM",
            "Lining: Solid Single Jersey 100% Cotton 150 GSM",
            "Shell fabric: 100% Recycled Polyester PU membrane, 240 GSM",
            "Sleeves: 82% Recycled Nylon, 18% Spandex PU membrane, Recycled",
            "stretch fleece, 280 GSM",
            "Our DWR softshell fleece bonded Dura Softshell jacket is an ideal",
            "pick for workers performing outdoor tasks in cold environments. The",
            "Dura Softshell jacket is designed to offer, freedom of movement and",
            "breathability while withstanding the rigors of rain and wind. The stretch",
            "in the shell fabric provides unrestricted movement.",
            "Shell: 100% Elasticated Polyester TPU, 300 GSM"
        ]
    },
    {
        "id": 32,
        "name": "DWR FLEXI FORCE JACKET",
        "description": "Midas Safety’s Waterproof Stretch Workwear Jacket is the perfect option for working in low-temperature environments. This jacket has a waterproof, membrane-lined exterior to keep you protected during moderate rain and wind while working outdoors. The contrasting reflective accent ensures visibility in low-light conditions. Front pockets provide convenient storage for essentials, while the full front DWR zipper closure prevents water from entering. Stay warm and comfortable with our Nova Recycled Fleece jacket. Made from soft, deep-pile 100% recycled polyester and finished with several practical features. The jacket features a boxy fit, striking contrast, 2 side pockets, and a practical high neck with long sleeves and elasticated edging. Made from high-quality recycled polyester, it not only offers a trendy look but also actively contributes to reducing waste and environmental pollution. Stay cozy and stylish with the Nord Teddy fleece jacket. This premium garment features a soft, high-pile exterior and a breathable lining for optimal warmth. The contrasting black fabric adds a classic touch, while practical details like zippers, a chin guard, and wind protection ensure comfort and functionality. The spacious pockets provide convenient storage and keep your hands warm, making this jacket a must-have for cold-weather adventures. The jacket, crafted from two technical materials, features a unique quilted front panel that offers a contrasting appearance and color scheme. Its ultra- lightweight and shiny front panel quilting provides a technical appeal and ensures an incredibly comfortable fit. The original design incorporates a quilted front, while the sleeves and back are made of stretchable contrasting fabrics, allowing for unrestricted movement. This jacket is not only warm and stylish but also offers a distinctive look for those who want to stand out. It boasts practical Introducing a Reversible quilted parka perfect for fall. This parka",
        "features": [
            "Elasticated cuffs",
            "DWR Zippers on front closure and pockets",
            "Reflective mesh vents",
            "Detachable and toggle adjustable hood",
            "Bonded inside brushed fleece",
            "Segmented cut and sew for ease of movement",
            "Zip off detachable hood",
            "Multiple front pockets with contrasting hi-vis, waterproof zipper",
            "NOVA RECYCLED FLEECE JACKET",
            "Elasticated hem and sleeve",
            "Front side pockets",
            "1 Inside and 2 side pockets to store the essentials",
            "100% GRS Recycled Polyester",
            "Shell fabric: 94% Polyester, 6% Spandex TPU Softshell Fleece, 240 GSM",
            "69",
            "midassafety.com",
            "NORD RECYCLED TEDDY FLEECE",
            "JACKET",
            "Elasticated hem and sleeve",
            "Inside pockets to store the essentials",
            "GRS Certified 100% Recycled fabric",
            "WEATHERPROOF MAVERICK JACKET",
            "large zipped pockets. The water-repellent and down-proof fabric ensures",
            "maximum comfort and style during the cold season, making this jacket a perfect",
            "choice for anyone seeking both warmth and fashion.",
            "Stretch fabrics for mobility",
            "Drawcord and toggle adjuster hood",
            "DWR Zippers",
            "Front pocket",
            "Cut and sew for an ergonomic fit",
            "Shell fabric: 100% Recycled Polyester, 240 GSM",
            "70",
            "midassafety.com",
            "REVERSIBLE QUILTED PARKA",
            "construction to keep you dry in any weather. The quilted interior",
            "provides extra warmth, and the reversible style offers a sporty and",
            "urban twist on the classic quilted look. The parka has an elegant, slightly",
            "relaxed fit, making it ideal for layering over basic work attire without",
            "sacrificing style. It also includes a center-front zipper with a hidden-",
            "button storm flap,"
        ],
        "fabrics": [
            "Shell fabric: 100% GRS recycled Polyester, 240 GSM",
            "Shell fabric: 90%Nylon,10%Spandex-300 Gsm",
            "Hi-Vis contrast: 75D/40D*75D/40D/300D, 92% Polyester and 8% Spandex-190 GSM",
            "Quilting Front Panel: 100% cotton 210 GSM"
        ]
    },
    {
        "id": 33,
        "name": "ECO BLUE SCRUBS",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 34,
        "name": "ECO-BLUE SCRUBS SET",
        "description": "Our two-piece medical scrub for men is a great option for healthcare professionals who want to look stylish and professional. The eco-friendly scrub set features a unique triple-stitch design that enhances your appearance without compromising functionality. The V-neck top comes with multiple pockets, making it easy for you to access your essentials. The pants offer comfortable movement and flexibility for long shifts. Whether you’re a doctor, nurse, or any other healthcare professional, our two-piece medical scrub for men is the perfect choice to help you look and feel your best while at work. RUHE SCRUBS SET",
        "features": [
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "Darted front seams with multiple pockets",
            "Multiple bottom pockets",
            "82",
            "midassafety.com",
            "FRIEDEN SCRUBS SET",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "2 side pockets",
            "Straight-fit trousers",
            "Multiple bottom pockets",
            "Lightweight and long-lasting",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "2 side pockets",
            "Straight-fit trousers",
            "83",
            "midassafety.com",
            "Shell:  65% Polyester, 35% Cotton, 2/1 Twill, 160 GSM",
            "CUT",
            "RESISTANT",
            "85",
            "midassafety.com",
            "CUT RESISTANT-SWEATSHIRT",
            "Made up of a blend of Polyester yarn, Glass Fibers, UHMWPE (Ul-",
            "tra High Molecular Weight Polyethylene), Spandex & Coolmax",
            "Jackets & pullovers are made in a 12gg machine while aprons",
            "being made in 7gg machine",
            "Highly breathable and comfortable PPE garment",
            "High neck protection with Coolmax to provide maximum",
            "comfort",
            "Sleeves available in thumb loop and thumbhole",
            "Provided with webbings and lock for improved grip",
            "Protection Levels as Per ASTM – F2992",
            "Pullover: Body (A3), Rib (A6), Interlock & Neck (A7)",
            "Shirts: Body (A3) & Rib (A5)",
            "Aprons: Body (A9)",
            "86",
            "midassafety.com",
            "CUT RESISTANT-SWEATSHIRT"
        ],
        "fabrics": [
            "Shell: 81.5% PIW Cotton, 17.5% Reprieve Polyster, 1% Elastane, 340 GSM",
            "Our Men’s Casual Two-Piece Denim Medical Scrub is perfect for healthcare",
            "professionals who want to look and feel their best at work. This eco-friendly",
            "set features a unique triple-stitch design that adds a touch of style without",
            "compromising on professionalism. The V-neck top has multiple pockets",
            "that make it easy to access your essentials, while the pants are designed",
            "for comfort and mobility, allowing you to move with ease during long shifts.",
            "Whether you’re a doctor, nurse, or any other healthcare professional, this",
            "scrub will give you the confidence you need to perform your job with ease.",
            "Add a touch of excitement to your hectic workday with our Two-Tone",
            "Medical Scrub. This flattering-fit set features a V-neck and short sleeves",
            "for a stylish and professional look. The matching pants have an elastic",
            "waist for long-lasting comfort during your shift.",
            "Whether you’re a doctor, nurse, or other healthcare professional, our",
            "Two-Tone Medical Scrub is the perfect choice for those who want to look",
            "and feel their best while on the job.",
            "Shell:  50% Cotton, 50% Polyester, 190 GSM",
            "33% UHMWPE, 58% Nylon, 8% Glass, 1% Spandex",
            "35% UHMWPE, 30% Polyester, 2% Spandex, Coolmax",
            "Midas Cut Resistant Clothing is designed to provide protection to workers",
            "in the glass, industrial manufacturing, and food processing industries. It",
            "provides protection to the body to mitigate the risk of cut injuries while being",
            "comfortable in workshops and industrial environments.",
            "Our Cut Resistant clothing has a wide range of products including pullovers,",
            "aprons, chaps and sleeves conforming from A3 to A9 levels of protection",
            "classes.",
            "Garments are made up of breathable Coolmax technology to provide",
            "comfort.",
            "Midas Cut Resistant Clothing is designed to provide protection to",
            "workers in the glass, industrial manufacturing, and food processing",
            "industries. It provides protection to the body to mitigate the risk of",
            "cut injuries while being comfortable in workshops and industrial",
            "environments.",
            "Our Cut Resi"
        ]
    },
    {
        "id": 35,
        "name": "ECO-Fleece work jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 36,
        "name": "ECO-TERRAIN WORK Pants",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 37,
        "name": "EnviroArmor pants",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 38,
        "name": "Excel FR Coverall",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 39,
        "name": "Filan trouser",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 40,
        "name": "FR ANTISTATIC BALACLAVA-GREY WHI",
        "description": "Midas Safety’s FR balaclavas are an essential form of personal pro- tective equipment (PPE) intended to safeguard workers in industries where fire and heat hazards are prevalent. Constructed from special- ized materials that resist ignition and self-extinguish in the event of a fire, these balaclavas are made from Midas Safety’s 100% Meta aramid The Performer Utility Jacket is the perfect way to stay warm and stylish on chilly days. Its durable quilted pattern and comfortable fabric will keep you cozy, while the trendy camouflage print adds to its appeal. This jacket is perfect for outdoor workers, thanks to its classic fleece construction and quilted water-repellent overlay at the back. It also features an elbow mesh vent for breathability, long sleeves for protection, a kangaroo pocket for storage, and cozy hand pockets for added warmth. With unbeatable warmth and a full range of motion, the Performer Utility Jacket is perfect for any outdoor task.",
        "features": [
            "Prevents the buildup of static electricity, reducing the risk of ignition.",
            "Full Face Coverage: Protects the face, neck, and ears from harmful",
            "elements.",
            "Breathable Fabric: Allows for comfortable wear, even in demanding",
            "conditions.",
            "Protection from Flame spread, Heat resistance, Tear/Tensile",
            "strength, Liquid repellence",
            "EN11612, EN469:2005 , EN1149 Antistatic",
            "Shell fabric: 93% Meta-aramid, 5% Para-aramid, 2% Antistatic (Grey-white), 210-230g",
            "FR BALACLAVA-BLACK",
            "Flame-Resistant Material: Ensures protection against fire and heat",
            "hazards.",
            "Full Face Coverage: Protects the face, neck, and ears from harmful",
            "elements.",
            "Breathable Fabric: Allows for comfortable wear, even in demanding",
            "conditions.",
            "Comfortable Fit: Designed for a snug yet comfortable fit.",
            "39",
            "midassafety.com",
            "INDUSTRIAL",
            "COVER CARGO TROUSER",
            "Sealed seams to avoid water penetration",
            "Comfortable, loose, and wide fit trousers",
            "Cordura patch knee and seat area",
            "DWR Zippers",
            "Stretch Cordura patch at the knee for ease of movement",
            "Elasticated waist",
            "2 front, 2 spacious side pockets, and 2 attached back pockets",
            "with a flap",
            "41",
            "midassafety.com",
            "PERFORMER UTILITY JACKET",
            "Arm vents with mesh-lined",
            "DWR zippers",
            "Soft fleece hood with dr"
        ],
        "fabrics": [
            "Midas Safety’s FR antistatic balaclava is a vital piece of personal protective",
            "equipment (PPE) designed to protect workers in hazardous environments.",
            "These balaclavas are made from our vertically developed FR fabric, helping",
            "in resistance to ignition, and can self-extinguish if they catch sudden fire.",
            "Additionally, their antistatic properties help to prevent the buildup of static",
            "electricity, which can ignite flammable materials.",
            "design includes an eye opening and ensures complete coverage of",
            "the head, face, and neck, providing exceptional warmth and a snug fit",
            "due to the elasticity of the fire-resistant fabric. With a wider neck area",
            "and minimal seams, it can be comfortably worn under a protective",
            "helmet without causing any discomfort.",
            "Shell fabric: 100% Meta-aramid (BLK), 280-300g",
            "The Midas Safety Cover Cargo Trouser is a durable and versatile",
            "work pant that is perfect for tough environments. Made from 100%",
            "nylon with seam taping, it is waterproof and resistant to water, dirt,",
            "and oil.",
            "The trousers feature triple-stitched reinforced seams and a stretch",
            "Cordura knee patch for unrestricted movement. They also have an",
            "adjustable waist and a tough nylon zip.",
            "For added protection in wet or cold conditions, the Cover Cargo",
            "Trouser can be worn over other trousers with its durable, PVC",
            "coating on the inside.",
            "Shell: 100% Nylon, 160 GSM",
            "Reinforcement: 100% Nylon, 180 GSM",
            "Shell: 100% Polyester Quilt, 280 GSM",
            "Contrast: 80% Cotton, 20% Polyester Fleece, 280 GSM",
            "Lining: Solid Single Jersey 100% Cotton, 150 GSM",
            "Rib: Camo printed Rib 1x1, 97% Cotton, 3% Spandex, 425 GSM"
        ]
    },
    {
        "id": 41,
        "name": "FR BALACLAVA-BLACK",
        "description": "Midas Safety’s FR balaclavas are an essential form of personal pro- tective equipment (PPE) intended to safeguard workers in industries where fire and heat hazards are prevalent. Constructed from special- ized materials that resist ignition and self-extinguish in the event of a fire, these balaclavas are made from Midas Safety’s 100% Meta aramid The Performer Utility Jacket is the perfect way to stay warm and stylish on chilly days. Its durable quilted pattern and comfortable fabric will keep you cozy, while the trendy camouflage print adds to its appeal. This jacket is perfect for outdoor workers, thanks to its classic fleece construction and quilted water-repellent overlay at the back. It also features an elbow mesh vent for breathability, long sleeves for protection, a kangaroo pocket for storage, and cozy hand pockets for added warmth. With unbeatable warmth and a full range of motion, the Performer Utility Jacket is perfect for any outdoor task. The Briskly Rider Jacket is specifically designed to keep riders safe and protected while on the road. Its Kevlar shell provides exceptional protection for the elbows and shoulders and is reinforced with CE approved padding to prevent injuries in case of a fall. The jacket’s Kevlar shell also acts as a protective barrier between the rider’s skin and the road surface in case of an accident where the rider or pillion passenger falls from the motorcycle and slides along the road. For added comfort and protection, the jacket features a knitted 100% Meta-Aramid lining that offers excellent thermal stability, flame resistance, electrical insulation, chemical stability, and radiation resistance.",
        "features": [
            "Flame-Resistant Material: Ensures protection against fire and heat",
            "hazards.",
            "Full Face Coverage: Protects the face, neck, and ears from harmful",
            "elements.",
            "Breathable Fabric: Allows for comfortable wear, even in demanding",
            "conditions.",
            "Comfortable Fit: Designed for a snug yet comfortable fit.",
            "39",
            "midassafety.com",
            "INDUSTRIAL",
            "COVER CARGO TROUSER",
            "Sealed seams to avoid water penetration",
            "Comfortable, loose, and wide fit trousers",
            "Cordura patch knee and seat area",
            "DWR Zippers",
            "Stretch Cordura patch at the knee for ease of movement",
            "Elasticated waist",
            "2 front, 2 spacious side pockets, and 2 attached back pockets",
            "with a flap",
            "41",
            "midassafety.com",
            "PERFORMER UTILITY JACKET",
            "Arm vents with mesh-lined",
            "DWR zippers",
            "Soft fleece hood with drawcords for additional warmth",
            "Zipped hand pockets with soft pocket bag lining",
            "BRISKLY RIDER JACKET",
            "Durable and strong fabric mate"
        ],
        "fabrics": [
            "design includes an eye opening and ensures complete coverage of",
            "the head, face, and neck, providing exceptional warmth and a snug fit",
            "due to the elasticity of the fire-resistant fabric. With a wider neck area",
            "and minimal seams, it can be comfortably worn under a protective",
            "helmet without causing any discomfort.",
            "Shell fabric: 100% Meta-aramid (BLK), 280-300g",
            "The Midas Safety Cover Cargo Trouser is a durable and versatile",
            "work pant that is perfect for tough environments. Made from 100%",
            "nylon with seam taping, it is waterproof and resistant to water, dirt,",
            "and oil.",
            "The trousers feature triple-stitched reinforced seams and a stretch",
            "Cordura knee patch for unrestricted movement. They also have an",
            "adjustable waist and a tough nylon zip.",
            "For added protection in wet or cold conditions, the Cover Cargo",
            "Trouser can be worn over other trousers with its durable, PVC",
            "coating on the inside.",
            "Shell: 100% Nylon, 160 GSM",
            "Reinforcement: 100% Nylon, 180 GSM",
            "Shell: 100% Polyester Quilt, 280 GSM",
            "Contrast: 80% Cotton, 20% Polyester Fleece, 280 GSM",
            "Lining: Solid Single Jersey 100% Cotton, 150 GSM",
            "Rib: Camo printed Rib 1x1, 97% Cotton, 3% Spandex, 425 GSM",
            "Shell: 83% Nylon, 12% Kevlar, 5% Elastane, 300GSM",
            "Lining: 100% Para-Aramid, 270 GSM"
        ]
    },
    {
        "id": 42,
        "name": "FR Blaze Guard Coverall",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 43,
        "name": "FR Cargo pants",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 44,
        "name": "FR Contrasting pants (img + 3D)",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 45,
        "name": "FR Denim jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 46,
        "name": "FR Female Hybrid shirt",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 47,
        "name": "FR GUARD PANTS",
        "description": "Our FR Performer pants are designed to shield workers from serious fire hazards in high-risk industries like utilities, fuel distribution, petrochemicals, and power generation. With a streamlined fit, holster pockets, side cargo pockets, flap-covered knee pad pockets, back pockets, and hanging loops, these pants are perfect for the FR workwear needs. The FR Performer pants are durable and designed to protect workers from fire hazards in the workplace. They are ideal for workers in high- risk industries such as utilities, fuel distribution, petrochemicals, and power generation, where arc flash and fire risks are a constant threat. Featuring a streamlined and straight fit, spacious front pockets, a flap-covered knee pad pocket, a hanging loop at the front, and a double-layered front placket and collars, the FR Performer pants provide both comfort and protection. Our men’s FR cargo pants are tough, durable, and visible, making them the perfect choice for workers in hazardous environments. Crafted with hard work in mind, these pants are built to withstand fire risks and provide all-day comfort and durability. Made from 100% ripstop cotton, the pants feature a relaxed fit through the seat and thigh, functional side pockets, and lightweight construction, making them ideal for a variety of tasks.",
        "features": [
            "multiple pockets for tool storage",
            "Flap-covered knee pad pocket",
            "Breathable and comfortable",
            "Rear pocket with flaps",
            "Twisted leg design for improved comfort",
            "Internal kneepad pocket",
            "Aramid FR Threads",
            "Compliant to EN11612, EN11611 EN ISO 14116, ATPV=8CAL, IEC",
            "61482-2 standards",
            "front multiple pockets",
            "ATPV=8CAL",
            "Flap-covered knee pad pocket",
            "Breathable and comfortable",
            "Rear pocket with flaps",
            "Twisted leg design for improved comfort",
            "Internal kneepad pocket",
            "Aramid FR Threads",
            "Compliant to EN11612, EN11611 EN ISO 14116, ATPV=8CAL, IEC",
            "61482-2 standards",
            "FR CARGO PANTS:",
            "Flap-covered knee pad pocket",
            "Flame Resistance, Comfortable fit with soft hand feel",
            "kneepad pocket",
            "Compliant to 11612, 11611, EN 13034, EN 1149",
            "Negastat Finish Flat, FR Proban, and Chemical Protection",
            "31",
            "midassafety.com",
            "INCOMBUSTIBLE ALPHA",
            "Flap covered placket opening",
            "Patch pocket on the chest with stud-secure flap",
            "Working cuff with button fastening",
            "Multiple pockets",
            "Loose straight fit with a cut and sew",
            "Trouser Dart for a sleek fit",
            "32",
            "midassafety.com",
            "AUTO-PORTANT FEMALE",
            "COVERALL"
        ],
        "fabrics": [
            "Shell: Hi-Vis FR, 54% Modacrylic, 34% Cotton, 7% Kevlar, 3% Polyamide,",
            "2% Anti-static,  2/2 Twill, 300 GSM,",
            "Contrast: FR -54% Modacrylic, 34% Cotton,7% Kevlar, 3% Polyamide,",
            "2% Anti-static, 2/2 Twill, 300 GSM",
            "30",
            "midassafety.com",
            "FR CONTRASTING PANTS",
            "Shell: FR -54%Modacrylic, 34% Cotton,7% Kevlar, 3% Polyamide, 2%",
            "Anti-static,  2/2 Twill, 300 GSM",
            "Shell: 75% Cotton, 24% Polyester, 1% Anti-static, 2/1 S-Twill, 265 GSM",
            "Working on oil and gas rigs can be dangerous, as workers are at risk",
            "of flash fires and thermal hazards. The Incombustible Alpha Coverall",
            "is a necessary item for keeping workers safe in these environments.",
            "It offers a comfortable fit and breathable fabric, making it perfect",
            "for all-day wear.",
            "The Incombustible Alpha Coverall is popular among workers in a",
            "variety of industries, including petroleum, gas, electric, aluminum,",
            "and chemical. It provides reliable protection against flash fires and",
            "arc flash hazards.",
            "100%Cotton, Proban treated FR, 3/1 Twill, 220 GSM",
            "Our Auto-Portant Female Flame-Resistant Coveralls are both",
            "comfortable and durable, making them ideal for women working in",
            "environments where fire hazards are a potential risk. Popular with",
            "workers in the petroleum, gas, electric, aluminum, and chemical",
            "industries, these coveralls protect against flash fires and arc flashing.",
            "Made from 100% FR cotton twill, they are soft and comfortable",
            "enough to wear all day, yet tough enough to withstand the rigors of",
            "the workplac"
        ]
    },
    {
        "id": 48,
        "name": "FR Lit armor vest",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 49,
        "name": "FR Mihawk Jacket",
        "description": "The FR Hybrid Shirt for Women is specially tailored for women to provide a comfortable and supportive fit, while also ensuring the highest level of flame resistance and durability. Made with inherent FR yarns and lined with Modacrylic and Viscose plain interlock Our FR Performer pants are designed to shield workers from serious fire hazards in high-risk industries like utilities, fuel distribution, petrochemicals, and power generation. With a streamlined fit, holster pockets, side cargo pockets, flap-covered knee pad pockets, back pockets, and hanging loops, these pants are perfect for the FR workwear needs.",
        "features": [
            "Full-length front zip",
            "Chest zip pocket",
            "Zip pocket on sleeve",
            "Multiple front pockets",
            "Sleeve pockets",
            "A hood, and shoulder loops",
            "A flap-covered placket",
            "Tough and durable fabric to last longer",
            "Compliant to EN11612, EN11611 EN ISO 14116, ATPV=8CAL, IEC",
            "61482-2 standards",
            "28",
            "midassafety.com",
            "FR BRIO SHIRT",
            "FR HYBRID SHIRT",
            "FR Buttons",
            "Front Flap pockets",
            "Lightweight contrasting classic shirt",
            "Modacrylic, Viscose lined",
            "Loose straight fit",
            "Excellent Flame Resistance, Soft, Comfortable",
            "Compliant with ISO 1149, EN ISO 11612, EN ISO 1161, EN ISO 14116",
            "standards",
            "FR Buttons",
            "Front Flap pockets",
            "Lightweight contrasting classic shirt",
            "Modacrylic, Viscose lined",
            "Loose straight fit",
            "Excellent Flame Resistance, Soft, Comfortable",
            "29",
            "midassafety.com",
            "FR GUARD PANTS",
            "multiple pockets for tool storage",
            "Flap-covered knee pad pocket",
            "Breathable and comfortable",
            "Rear pocket with flaps",
            "Twisted leg design for improved comfort",
            "Internal kneepad pocket",
            "Aramid FR Threads",
            "Compliant to EN11612, EN11611 EN ISO 14116, ATPV=8CAL, IEC",
            "61482-2 standards"
        ],
        "fabrics": [
            "75% Cotton, 24% Polyester, 1% Antistatic, 2/1 S Twil, 265 GSM",
            "27",
            "midassafety.com",
            "TWO-TONE FR COVERALL",
            "Designed for women working in extreme environments, our Two-Tone",
            "Premium Coveralls provide superior protection and comfort. Made from",
            "100% FR cotton twill, they offer a soft, comfortable fit for all-day wear,",
            "while also safeguarding against flash fires, arc flash, and other hazards.",
            "Built to withstand the rigors of the workplace, these coveralls are a",
            "reliable and durable choice for female workers in a variety of industries,",
            "including petroleum, gas, electric, aluminum, and chemical.",
            "Shell: 99% Cotton, 1% Anti-Static, 3/1 Twill, 450 GSM",
            "Contrast: 54% Modacrylic, 34% Cotton, 7% Kevlar, 3% Polyamide, 2% Anti-",
            "Static, 300 GSM, 2/2 Twill",
            "The FR BRIO Shirt is a classic workwear essential with a modern",
            "design. It features high flame-resistant (FR) properties to ensure",
            "maximum protection while still maintaining a sleek appearance.",
            "The shirt is tailored to provide a comfortable and supportive fit that",
            "is ideal for work and designed to keep workers safe and secure in",
            "hazardous environments. Made from high-quality materials, the FR",
            "BRIO Shirt is extremely durable and protective.",
            "Shell: FR Proban 88% Cotton, 12% Nylon, 2/2 Z Twill Yarn Dyed, 240 GSM",
            "Contrast: 9% Meta-Aramid, 20% Modcrylic, 1% Antistatic, 2/1 Z twill, 205 GSM",
            "safe and secure.",
            "FR Flannel: 88% Cotton, 12% Nylon, 2/2 Z Twill Yarn Dyed, 240 GSM, FR",
            "Proban",
            "Contrast: 9% Meta-Armid 20% Modcrylic1% Antistatic, 2/1 Z twill, 205 Gsm",
            "Lining: Modacrylic, 50 %+ Viscose, 50%, 200 GSM",
            "Shell: Hi-Vis FR, 54% Modacrylic, 34% Cotton, 7% Kevlar, 3% Polyamide,",
            "2% Anti-static,  2/2 Twill, 300 GSM,",
            "Contrast: FR -54% Modacrylic, 34% Cotton,7% Kevlar, 3% Polyamide,",
            "2% Anti-static, 2"
        ]
    },
    {
        "id": 50,
        "name": "FR Pro-Weather shield Parka",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 51,
        "name": "FR Reflective-Cargo Pants",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 52,
        "name": "FR TERRA overlay shirt",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 53,
        "name": "FREEZER WEAR COVERALL",
        "description": "Midas Safety’s freezer coveralls are designed to keep you warm and protected in harsh work environments. The suit features heavy-duty zippers and wind-resistant flaps to keep out the elements, allowing you to focus on your work without worrying about freezing temperatures or moisture. Whether you’re working in cold storage, processing frozen food, or handling goods in refrigerated trucks, this insulated suit offers superior protection. It is designed with reinforced stitching, side leg snaps for easy boot access, and a full front DWR zipper closure to prevent water from entering. These freezer suits also come with deep pockets for convenient storage of tools and personal items, and an optional snap-on hood for full head coverage when needed. The double-reinforced stitching in high-stress areas ensures durability, while the wind-tight, water-repellent fabric keeps you warm and dry even in the most frigid conditions. The Tencel cargo pants are made with soft, breathable Tencel hoosing the right workwear is essential for staying comfortable & productive all day long, especially in demanding jobs. Our fleece work jacket is designed specifically for service industry workers, offering exceptional comfort and freedom of movement. Made from soft and breathable fleece, this jacket will keep you warm and cozy on cooler days, without restricting your movement. It also features a front patch pocket for storing essentials, & a high collar for extra warmth. For a complete & professional look, pair the fleece work jacket with our sustainable fleece trousers. These trousers are made from recycled materials, & offer the same level of comfort & durability as the jacket. Together, the fleece work jacket and trousers make the perfect workwear ensemble for service industry workers. As a painter, it is very important that the workwear you choose is equipped with the right pockets and features for your work, and that wi",
        "features": [
            "Taped seams",
            "Reflective accent piping",
            "Heavy Quilting Inside",
            "Segmented cut and sew for ease of movement",
            "Zip off detachable hood",
            "50 degrees of protection, -46 Celsius cold comfort",
            "Shell fabric: 100% Polyester, 185 GSM",
            "Fleece Inner: 100% GRS recycled Polyester, 240 GSM",
            "SERVICES",
            "TENCEL CARGO PANTS",
            "TERRA OVERLAY SHIRT",
            "Patch pocket on the chest with stud-secure flap",
            "Working cuff with button fastening",
            "Loose straight fit with a cut and sew",
            "Peach finished, Soft hand feel",
            "Eco-friendly material",
            "Stretchy, Soft hand feel",
            "Straight-fit pants",
            "Hook and bar closure with zip fly",
            "Slash pockets at the front",
            "Side flap patch pockets at legs",
            "73",
            "midassafety.com",
            "ECO-FLEECE WORK JACKET",
            "100% Recycled materials",
            "Front patch zipper pocket",
            "Elasticated waist",
            "Cut and sew details",
            "Reflective tapes on the sleeve",
            "Shoulder straps",
            "Ribbed Sleeve",
            "Slim straight fit",
            "74",
            "midassafety.com",
            "SUSTAINABLE-FLEECE WORK TROUSER"
        ],
        "fabrics": [
            "Shell fabric: 40% Polyester, 60% 40Cotton DWR, 240 GSM",
            "100 Polyester Quilting- 250 GSM",
            "convenience. The classic beige color adds a touch of sophistication to",
            "any service wardrobe. Plus, with a blend of cotton and Spandex, these",
            "pants offer both comfort and flexibility for unrestricted movement.",
            "The TERRA OVERLAY shirt is an essential addition to any worker’s wardrobe",
            "in the services industry. It features a classic design that’s perfect for",
            "workwear and provides exceptional comfort for outdoor tasks. The soft",
            "twill fabric feels great against the skin and helps you maintain your",
            "elegance all day long. It’s also designed to offer a comfortable and",
            "supportive fit. The cotton content in the fabric keeps the shirt breathable.",
            "Shell Fabric: 67% Cotton, 30% Tencel, 3% Spandex, 200 GSM",
            "Shell Fabric: 55% Recycled Polyester, 35% Cotton, 10%Tencel, 200 GSM",
            "Shell Fabric: 65% Cotton, 35% Recycled Polyester fleece, 200 GSM"
        ]
    },
    {
        "id": 54,
        "name": "FRIEDEN SCRUBS SET",
        "description": "Our two-piece medical scrub for men is a great option for healthcare professionals who want to look stylish and professional. The eco-friendly scrub set features a unique triple-stitch design that enhances your appearance without compromising functionality. The V-neck top comes with multiple pockets, making it easy for you to access your essentials. The pants offer comfortable movement and flexibility for long shifts. Whether you’re a doctor, nurse, or any other healthcare professional, our two-piece medical scrub for men is the perfect choice to help you look and feel your best while at work. RUHE SCRUBS SET",
        "features": [
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "2 side pockets",
            "Straight-fit trousers",
            "Multiple bottom pockets",
            "Lightweight and long-lasting",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "2 side pockets",
            "Straight-fit trousers",
            "83",
            "midassafety.com",
            "Shell:  65% Polyester, 35% Cotton, 2/1 Twill, 160 GSM",
            "CUT",
            "RESISTANT",
            "85",
            "midassafety.com",
            "CUT RESISTANT-SWEATSHIRT",
            "Made up of a blend of Polyester yarn, Glass Fibers, UHMWPE (Ul-",
            "tra High Molecular Weight Polyethylene), Spandex & Coolmax",
            "Jackets & pullovers are made in a 12gg machine while aprons",
            "being made in 7gg machine",
            "Highly breathable and comfortable PPE garment",
            "High neck protection with Coolmax to provide maximum",
            "comfort",
            "Sleeves available in thumb loop and thumbhole",
            "Provided with webbings and lock for improved grip",
            "Protection Levels as Per ASTM – F2992",
            "Pullover: Body (A3), Rib (A6), Interlock & Neck (A7)",
            "Shirts: Body (A3) & Rib (A5)",
            "Aprons: Body (A9)",
            "86",
            "midassafety.com",
            "CUT RESISTANT-SWEATSHIRT",
            "Made up of a blend of Polyester yarn, Glass Fibers, UHMWPE",
            "(Ultra High Molecular Weight Polyethylene), Spandex &",
            "Coolmax",
            "Jackets & pullovers are made in a 12gg machine while",
            "aprons being made in 7gg machine",
            "Highly breathable and comfortable PPE garment",
            "High neck protection with Coolmax to provide maximum",
            "comfort",
            "Sleeves available in thumb loop and thumbhole",
            "Provided with webbings and lock for improved grip",
            "Protection Levels as Per ASTM – F2992",
            "Pullover: Body (A3), Rib (A6), Interlock & Neck (A7)",
            "Shirts: Body (A3) & Rib (A5)",
            "Aprons: B"
        ],
        "fabrics": [
            "Add a touch of excitement to your hectic workday with our Two-Tone",
            "Medical Scrub. This flattering-fit set features a V-neck and short sleeves",
            "for a stylish and professional look. The matching pants have an elastic",
            "waist for long-lasting comfort during your shift.",
            "Whether you’re a doctor, nurse, or other healthcare professional, our",
            "Two-Tone Medical Scrub is the perfect choice for those who want to look",
            "and feel their best while on the job.",
            "Shell:  50% Cotton, 50% Polyester, 190 GSM",
            "33% UHMWPE, 58% Nylon, 8% Glass, 1% Spandex",
            "35% UHMWPE, 30% Polyester, 2% Spandex, Coolmax",
            "Midas Cut Resistant Clothing is designed to provide protection to workers",
            "in the glass, industrial manufacturing, and food processing industries. It",
            "provides protection to the body to mitigate the risk of cut injuries while being",
            "comfortable in workshops and industrial environments.",
            "Our Cut Resistant clothing has a wide range of products including pullovers,",
            "aprons, chaps and sleeves conforming from A3 to A9 levels of protection",
            "classes.",
            "Garments are made up of breathable Coolmax technology to provide",
            "comfort.",
            "Midas Cut Resistant Clothing is designed to provide protection to",
            "workers in the glass, industrial manufacturing, and food processing",
            "industries. It provides protection to the body to mitigate the risk of",
            "cut injuries while being comfortable in workshops and industrial",
            "environments.",
            "Our Cut Resistant clothing has a wide range of products including",
            "pullovers, aprons, chaps and sleeves conforming from A3 to A9 levels of",
            "protection classes.",
            "Garments are made up of breathable Coolmax technology to provide",
            "comfort.",
            "33% UHMWPE, 58% Nylon, 8% Glass, 1% Spandex",
            "35% UHMWPE, 30% Polyester, 2% Spandex, Coolmax"
        ]
    },
    {
        "id": 55,
        "name": "GUARD ZTONE STRETCH JACKET",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 56,
        "name": "Hardshell Hybrid jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 57,
        "name": "Heat sensing-EmviroArmor Jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 58,
        "name": "High Vis Benoni Jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 59,
        "name": "High Vis Tormund Jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 60,
        "name": "High Vis Windbreaker Jacket",
        "description": "Our High-Vis industrial trouser is a perfect companion when weather conditions get tough. This lightweight softshell trouser is comfortable and warm to cope up with the cold weather. The trouser is two toned with contrasting colors for optimal visibility. Additionally, the kneepad pockets are styled in cordura to allow optimal position setting on your knees. The trouser comes with a side ruler pocket , extra loops and detachable pockets. The 2 in 1 Reversible jacket is our engineered masterpiece with a bright yellow and Black waterproof Softshell. The garment features a fleece lining keeping the worker warm in winters. This jacket is a feature-packed workwear through versatility and visibility. The outer liner is styled with two chest and two zipper concealed pockets. The Black reversed side includes two chest and two storage pockets. The sleeves are Rib adjusted for maximum arm covering, designed for different weather conditions. The waterproof and breathable outer jacket can be worn separately or with the fleece liner.  The fleece liner also acts as a stand-alone jacket and looks great for a casual wear. When working in environments as cold as -20 degrees Celsius, it’s crucial to have specialized clothing that can protect the workers from hypothermia and frostbite. Midas Safety’s freezer-wear jackets are designed to provide maximum warmth and insulation in extreme conditions. Crafted with uncompromising quality and functionality, these freezer jackets are your ultimate companion in cold storage, industrial freezers, and harsh winter conditions. Built for tough outdoor jobs, the Athena jacket combines durability and comfort. Made from 100% polyester, this feature-packed jacket goes beyond just keeping the elements out. The classic straight fit and high-visibility color ensure you’ll be seen in low-light conditions. For enhanced safety, the jacket boasts UV protection and flame- retardant properties, all while maintaining a comfortable fit.",
        "features": [
            "Water repellant shell",
            "Water repellant zipper",
            "50 mm reflective tape",
            "Attached hood",
            "Two Storage front pockets",
            "Side vents with zipper opening and mesh",
            "HI-VIS INDUSTRIAL TROUSER"
        ],
        "fabrics": [
            "100% Polyester TPU 120gsm| 3.5oz",
            "94% Polyester, 6% Spandex 200gsm|5.9oz",
            "Waterproof and breathable",
            "Double stitched seams for strength",
            "Fly with zip",
            "2 spacious concealed side pockets and 2 thigh pockets with a",
            "flap, all with a zip",
            "2 concealed back pockets",
            "Adjustable kneepad pockets in cordura",
            "50 mm wide Fluorescent",
            "19",
            "midassafety.com",
            "HI-VIS REVERSIBLE JACKET",
            "94% Polyester, 6% Spandex 240gsm| 7.1 oz",
            "94% Polyester, 6% Spandex TPU 100D Hi-Vis- Yellow220gsm| 6.5 oz",
            "DWR Softshell with fleece bonding",
            "Rib attached at sleeves",
            "Side Zippers for ventilation and access to sidearm",
            "Water repellant Zippers",
            "4 parts button at the front placket",
            "50 mm Reflective tape",
            "20",
            "midassafety.com",
            "HI-VIS FREEZER WEAR JACKET",
            "Meets EN 342 Class 3",
            "Waterproof shell fabric keeping the wearer dry and protected",
            "from the elements",
            "Elasticated back waist for a secure fit",
            "Ribbed cuffs",
            "Wind-resistant fabric to protect against wind chill",
            "Elasticated waist with snap button",
            "Taped seams",
            "Shell fabric: 100% Polyester Ripstop with PU-220gsm",
            "Quilt: 100% Polyester-180 GSM",
            "HI-VIS ATHENA JACKET",
            "HI-VIS Yellow 100%Polyester-210gsm DWR, UPF 30+, FR",
            "Flammability: EN71-2",
            "UV resistance UPF 50+ UPF 30",
            "Rib cuffs wi"
        ]
    },
    {
        "id": 61,
        "name": "HI-VIS ZTONE POLO",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 62,
        "name": "HI-VIS BREAKEVEN MESH VEST",
        "description": "This general-purpose safety vest is made of 100% lightweight mesh material. It features a Front buckle adjustable closure and 2-inch orange/silver reflective tapes sewn vertically onto the vest front to back continuously to keep the wearer visible and comfortable in low-light conditions. It is ideal for workers performing at Forestry sites, crowd control, warehouses, and construction. Ensure you are always seen in low-light or high-traffic environments with the High Visibility Freezer Overalls. Designed with bright, hi-vis colors and reflective strips, these overalls meet ANSI safety standards to keep you visible and safe, even in the most challenging conditions. Whether working in a busy warehouse or dimly lit outdoor spaces, the enhanced visibility provided by these overalls ensures you remain prominent and safe. The double-stitched stress areas improve durability, making these overalls ideal for rigorous work environments. This High Visibility Rain Jacket is tested to the ANSI/ISEA 107 Standard. It features a 2” Silver reflective with orange contrasting tape for added visibility. Multiple pockets for ample storage: 2 lower welts with flaps, 1 internal tablet pocket, and 1 external pocket with ID window. Storm flap front with zipper and concealed snap closure vented back cape with D-ring opening. Designed to keep the wearer safe and protected in extreme -20 degrees, this jacket is lined with 275g quilting for warmth and is highly visible in cold and low-light work environments. Introducing Kewl Tech, our revolutionary phase change material vest. Utilizing the natural cooling power of evaporation. Phase change cooling jackets offer a much-needed respite from the sweltering heat and excessive perspiration experienced by workers in hot and humid plant environments. These innovative vests effectively cool our workforce, enhancing their productivity and allowing them to work longer hours without fatigue. How it works: Simply soak the vest in water for 5 minutes, and its specially formulated non-toxic material absorbs an astonishing amount of water. This stored water is then gradually released, providing sustained cooling through evaporation. As the water evaporates, By drawing heat away from the body, Kewl Tech helps to maintain a comfortable temperature, keeping the wearer cool, refreshed, and energized in challenging conditions.",
        "features": [
            "Breathable and comfortable fit",
            "Suitable for all industries where poor visibility is part of the job",
            "Easy and quick wearing",
            "Strap and buckles for an adjustable fit- can be worn on size L to",
            "3XL over outer clothing",
            "Shell Fabric: 100% Polyester-110 GSM",
            "23",
            "midassafety.com",
            "HI-VISIBILITY FREEZER OVERALLS",
            "100 Polyester mesh, lightweight, breathable fabric",
            "HI-Vis class 2, CZSA96 Approved",
            "Toggle adjuster hood and velcros",
            "Sustains in -20 degrees weather",
            "Double stitching at all main seams",
            "Water-repellent material",
            "Front double pockets",
            "2-inch reflective striping",
            "Shell Fabric: 100%Poly Oxford PU Milky Coating Hi-Vis Yellow-250 GSM",
            "Simple V-neck w/ zipper closure",
            "Comfortable, quilted nylon outer shell",
            "KEWL FABRIC Patented technology middle layer",
            "Water-repellant nylon liner",
            "5-10 Hours of Cooling Per Soak• Lightweight and Comfortable Fit",
            "Ideal for Construction workers, Military personnel, Patrolling po-",
            "lice officers, Emergency Services and gardeners,"
        ],
        "fabrics": [
            "100 Polyester mesh, lightweight, breathable fabric",
            "Double stitching at all main seams",
            "Water-repellent and wind-tight material",
            "Front double pockets",
            "2-inch reflective striping",
            "Elasticized shoulder straps with non-conductive adjustable hardware",
            "HI-VIS RAIN PARKA",
            "Shell fabric: Hi-Vis: OXFORD 100% POLYESTER-200 GSM W/R, DWR, PU, PVC,",
            "PA, HI-VIS, FRVIS, FR",
            "Contrast: Navy 100% POLYESTER 2/2TWILL-220 GSM W/R, DWR, PU, PVC",
            "Quilting: 100% Poly Quilting-275 GSM",
            "24",
            "midassafety.com",
            "KEWL PHASE CHANGE VEST"
        ]
    },
    {
        "id": 63,
        "name": "Hi-Vis Fleece jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 64,
        "name": "HI-VIS FREEZER WEAR JACKET",
        "description": "When working in environments as cold as -20 degrees Celsius, it’s crucial to have specialized clothing that can protect the workers from hypothermia and frostbite. Midas Safety’s freezer-wear jackets are designed to provide maximum warmth and insulation in extreme conditions. Crafted with uncompromising quality and functionality, these freezer jackets are your ultimate companion in cold storage, industrial freezers, and harsh winter conditions. Built for tough outdoor jobs, the Athena jacket combines durability and comfort. Made from 100% polyester, this feature-packed jacket goes beyond just keeping the elements out. The classic straight fit and high-visibility color ensure you’ll be seen in low-light conditions. For enhanced safety, the jacket boasts UV protection and flame- retardant properties, all while maintaining a comfortable fit. Stay warm and visible with our Hivis and black contrasting sweatshirt. Crafted from a cozy polyester fleece, this sweatshirt offers both comfort and safety. Ideal for workers in the services industry, it’s the perfect option for construction, mining, warehouse, and transportation. The Hi-Vis knit Jacket is perfect for staying comfortable and visible. Crafted from lightweight, breathable knit fabric, this polo is ideal for hot and humid weather. The fabric construction allows optimal airflow, keeping the worker cool and dry throughout the day. The moisture- wicking properties help to prevent sweat build-up, ensuring maximum comfort while the reflective tapes keep the wearer visible in low light conditions. The Hi-Vis Rib-knit polo shirt is perfect for staying comfortable and visible at the job site. This High Visibility Long Sleeve Safety Polo Shirt is ENISO Class 2 Compliant. Made with lightweight 100% Knit Polyester, it features a rib-knit navy collar and a 3-buttoned placket for a professional appearance ensuring better breathability and providing high comfort during warm working days. This general-purpose safety vest is made of 100% lightweight mesh material. It features a Front buckle adjustable closure and 2-inch orange/silver reflective tapes sewn vertically onto the vest front to back continuously to keep the wearer visible and comfortable in low-light conditions. It is ideal for workers performing at Forestry sites, crowd control, warehouses, and construction.",
        "features": [
            "Shell Fabric: 100% Polyester-180 GSM",
            "22",
            "midassafety.com",
            "HI-VIS POLO SHIRT",
            "Breathable and comfortable fit",
            "Suitable for all industries where"
        ],
        "fabrics": [
            "Meets EN 342 Class 3",
            "Waterproof shell fabric keeping the wearer dry and protected",
            "from the elements",
            "Elasticated back waist for a secure fit",
            "Ribbed cuffs",
            "Wind-resistant fabric to protect against wind chill",
            "Elasticated waist with snap button",
            "Taped seams",
            "Shell fabric: 100% Polyester Ripstop with PU-220gsm",
            "Quilt: 100% Polyester-180 GSM",
            "HI-VIS ATHENA JACKET",
            "HI-VIS Yellow 100%Polyester-210gsm DWR, UPF 30+, FR",
            "Flammability: EN71-2",
            "UV resistance UPF 50+ UPF 30",
            "Rib cuffs with Quilting inside",
            "Dust, Water, soil, and oil repellant",
            "21",
            "midassafety.com",
            "HI-VIS SERVICES SWEATSHIRT",
            "Breathable and comfortable fit",
            "Suitable for all industries where poor visibility is part of the job",
            "Contrasting fabric that wicks away moisture",
            "Reflective glow-in-the-dark contrasting tape",
            "Shell Fabric: 50%Polyester, 50%Cotton, Fleece-300 GSM",
            "One chest pocket",
            "2-tone contrasting fabrics",
            "ENISO20471 Class1",
            "Button collar",
            "Front and back reflective tape",
            "Snap button closure",
            "Reflective tapes",
            "HI-VIS 2TONE POLO",
            "100% Polyester Rib-140 GSM Birdseye Knit",
            "One chest pocket",
            "Reflective Tape Safety: Features reflective tape for enhanced",
            "visibility in low-light conditions, prioritizing safety.",
            "2-tone contrasting fabric at cuff and collar",
            "EN20471 Class1",
            "Button collar",
            "Raglan sleeve",
            "HI-VIS BREAKEVEN MESH VEST"
        ]
    },
    {
        "id": 65,
        "name": "Hi-vis Illuminer Tech Jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 66,
        "name": "Hi-Vis Industrial Trouser",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 67,
        "name": "Hi-VIS RAIN PARKA",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 68,
        "name": "Hi-Vis Reversible Jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 69,
        "name": "Hi-Vis Safety Vest (img + 3D)",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 70,
        "name": "Hi-VIS SERVICES SWEATSHIRT",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 71,
        "name": "Hi-Vis Trouser (img + 3D)",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 72,
        "name": "Hi-VIS Weather-Guard jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 73,
        "name": "Hi-VISIBILITY FREEZER OVERALLS",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 74,
        "name": "Hunting Vest",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 75,
        "name": "Hybrid Denim jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 76,
        "name": "INCOMBUSTIBLE ALPHA coverall",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 77,
        "name": "INGRESS COVERALL",
        "description": "Looking for a multi-functional garment to support you during your Working days by distributing the load of heavy tools? Our combi suit gives you a combination of functional features from light weight breathable fabrics to abrasion resistance. This Combi suit comes with multiple pockets for tools and accessories. Combi suits are designed in a way to ensure that when switching between standing and kneeling work your clothing does not separate on your lower back. The extra back panel keeps your lower back shielded from cold drafts. Their wider shoulder panel ensures good weight distribution and lightens the load of heavy tools while preventing fatigue and sore muscles after a long working day.",
        "features": [
            "Slanted chest pocket with YKK Zipper closure",
            "Tool pocket on the backside",
            "Pen pocket on the left arm",
            "Two side cross pockets with vent pockets",
            "Two-way #5 heavy-duty YKK Coil zipper",
            "Reflective tapes",
            "Velcro patch for name tags",
            "End Use: Construction sites",
            "47",
            "midassafety.com",
            "48",
            "midassafety.com",
            "COMBI SUIT",
            "4-Way stretch fabric for movement",
            "Fluorescent contrast color with reflective tapes for visibility",
            "100% Nylon branded Cordura kneepad pockets",
            "Front closure with storm flap and stud fastening",
            "Two front chest pockets and back pockets with flaps",
            "Detachable holster pockets",
            "Press stud fastening on innermost hanging tool pocket",
            "Elasticated waistband with tool strap at both sides of waist",
            "Adjustable shoulder straps with hook and loop",
            "Ventilation in back through 100% polyester tricot mesh fabric",
            "49",
            "midassafety.com",
            "CANVAS CLASSIC BIB AND BRACE",
            "OVERALL",
            "A bib that stays dry all the time",
            "Breathable and water repellent fabric",
            "Relaxed fit with slightly tapered legs and regular waistline",
            "Water repellent Zipper on fly area",
            "Spacious front, side, and back pockets",
            "Loop for hammer",
            "Elasticated strap shoulder adjuster with suspender closure",
            "ANGOLA TROUSERS",
            "Trousers made up of blend of organic cotton, T400 & stretch",
            "with UPF50+ protection shield",
            "2-way nylon stretch fabric and branded CORDURA® reinforce-",
            "ments Buttoned Fly",
            "Extra wide detachable Holster pockets with zipper; multiple",
            "compartments for tools and additional zipped pocket for coins",
            "Front leg pockets with zippers for mobile and other accessories",
            "Cordura reinforced Knee panels for durability and high abrasion",
            "resistance",
            "50",
            "midassafety.com",
            "NYCO TOUGH-INDUSTRIAL JACKET",
            "DUAL INDUSTRIAL JACKET"
        ],
        "fabrics": [
            "This durable coverall is a must-have for workers in the construction",
            "industry. It features a sophisticated design, exceptional comfort,",
            "and practical features for side work requirements, such as two chest",
            "pockets, a rule pocket, and a concealed stud front.",
            "The special twill fabric is soft to the touch and helps maintain",
            "elegance throughout the day, while the comfortable and supportive",
            "fit ensures maximum freedom of movement.",
            "Shell: 100% Cotton, 3/1 Twill, 220 GSM",
            "Shell: 98% Cotton, 2% Elastane, 2/2 weave, 245 GSM",
            "Our classic Canvas Bib and Brace Overall provides you the",
            "toughness you need to take on a rugged workday.",
            "Water-repellent and engineered with extra durability right where",
            "you need it most.  For an easy fit, this bib and brace overall features",
            "elastic at the shoulders and waist adjustable to your perfect size.",
            "Designed with 2 front chest pocket and Side Tool pockets.",
            "98%Cotton, 2%Elastane, 2/2 weave 240gsm| 7.1oz",
            "Stout craftsman trousers with drop crotch and tapered legs. The trouser",
            "comes with Stretch panel in the waist & calf for comfortable movement.",
            "94% Cotton, 4% Polyester 2% Stretch, 220gsm|6.5oz",
            "Our Dual industrial-jacket is perfect for any worksite. Featuring jacket",
            "made of sturdy Cotton Poly blend fabric that can keep up with the",
            "toughness you need to take on a rugged workday. Multi Pocket with",
            "added vest engineers’ extra durability right where you need it most.",
            "Hard work comes easy in our Nyco Tough"
        ]
    },
    {
        "id": 78,
        "name": "Inherint Coverall",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 79,
        "name": "KEWL PHASE CHANGE VEST",
        "description": "Introducing Kewl Tech, our revolutionary phase change material vest. Utilizing the natural cooling power of evaporation. Phase change cooling jackets offer a much-needed respite from the sweltering heat and excessive perspiration experienced by workers in hot and humid plant environments. These innovative vests effectively cool our workforce, enhancing their productivity and allowing them to work longer hours without fatigue. How it works: Simply soak the vest in water for 5 minutes, and its specially formulated non-toxic material absorbs an astonishing amount of water. This stored water is then gradually released, providing sustained cooling through evaporation. As the water evaporates, By drawing heat away from the body, Kewl Tech helps to maintain a comfortable temperature, keeping the wearer cool, refreshed, and energized in challenging conditions. The FR Mihawk Jacket is made of durable Ripstop FR materials and boasts top-quality construction. It features an FR PU coating, making it essential for workers in the utility, fuel distribution, petrochemical, and power generation industries who need protection from work hazards. The jacket features front pockets, a streamlined fit, standing collars, and a double-layered front placket.",
        "features": [
            "Simple V-neck w/ zipper closure",
            "Comfortable, quilted nylon outer shell",
            "KEWL FABRIC Patented technology middle layer",
            "Water-repellant nylon liner",
            "5-10 Hours of Cooling Per Soak• Lightweight and Comfortable Fit",
            "Ideal for Construction workers, Military personnel, Patrolling po-",
            "lice officers, Emergency Services and gardeners, and any field",
            "worker performing in access heat.",
            "Shell Fabric: 100% Polyester-180 GSM",
            "Middle layer: Patented Kewl fabric",
            "FR &",
            "ANTI-STATIC",
            "FR BLAZE GUARD COVERALL",
            "Multiple front and arm pockets",
            "A hood, and shoulder loops",
            "A flap-covered placket",
            "Tough and durable fabric",
            "Breathable and , Soft hand feel",
            "FR MIHAWK JACKET",
            "FR TERRA OVERLAY SHIRT",
            "FR trims",
            "Front patch pockets",
            "Loose straight fit with a cut and sew",
            "Compliant with NFPA 2112, 11612, 11611 class 1, EN ISO 14116, And",
            "IEC 61482-2 standards",
            "Full-length front zip",
            "Chest zip pocket",
            "Zip pocket on sleeve"
        ],
        "fabrics": [
            "The Midas Safety Navy-Blue Blaze-Guard Coverall is a",
            "flame-resistant (FR) garment designed for comfort and durability",
            "in extreme environments. It is a popular choice for workers in the",
            "petroleum, gas, electric, aluminum, and chemical industries, as it",
            "protects against flash fires and arc flashing.",
            "Made from 100% FR cotton twill, the coverall is soft and comfortable for",
            "all-day wear. It is also built to withstand the rigors of the workplace with",
            "easy on-and-off capabilities, making it a staple for workers in need of",
            "reliable and durable protection for high-risk tasks.",
            "99%cotton, 1% Anti-Static 3/1 Twill, 450 GSM",
            "26",
            "midassafety.com",
            "The FR TERRA OVERLAY Shirt is a must-have for any worker’s wardrobe.",
            "This classic workwear essential encompasses a sophisticated design",
            "while providing exceptional flame-resistant (FR) protection. The",
            "lightweight and breathable fabric ensures maximum comfort while",
            "safeguarding against potential hazards. Designed for a comfortable",
            "and supportive fit, this shirt is tailored to keep workers safe and secure",
            "while performing in hot and hazardous environments.",
            "100% Cotton, 3/1 Twill, 260 GSM",
            "75% Cotton, 24% Polyester, 1% Antistatic, 2/1 S Twil, 265 GSM",
            "27",
            "midassafety.com",
            "TWO-TONE FR COVERALL",
            "Designed for women working in extreme environments, our Two-Tone",
            "Premium Coveralls provide superior protection and comfort. Made from",
            "100% FR cotton twill, they offer a soft, comfortable fit for all-day wear,",
            "while also safeguarding against flash fires, arc flash, and other hazards.",
            "Built to withstand the rigors of the workplace, these coveralls are a",
            "reliable and durable choice for female workers in a variety of industri"
        ]
    },
    {
        "id": 80,
        "name": "Lumen Hi-Vis Jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 81,
        "name": "Lumia Reflective cargo pants",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 82,
        "name": "Maven Utility cargo pants",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 83,
        "name": "MESH HI-VIS VEST",
        "description": "The Hi-Vis Poly Mesh Break-Away Vest is designed to increase worker safety and visibility in low-light conditions. Made of DWR fabric with silver reflective tapes and front pockets, this ultra-lightweight vest can be easily worn over basic workwear. The Midas Benoni Softshell jacket is a perfect companion when weather conditions get tough. It is two toned with stylish use of contrast colors along with transverse reflective strips in exposed areas for Hi-visibility. This lightweight softshell jacket is functional, comfortable, and keeps the wearer warm through its inner fleece lining. This water proof jacket comes with front pockets for storage space. Our Tormund Jacket is a premium softshell safety jacket capable of withstanding harsh weather conditions. Packed with thoughtfully designed features, this jacket is guaranteed to keep the worker comfortable, visible, and safe on the job site. Utilizing high-quality reflective tapes helps in heat transfer to boost visibility in low light. The jacket is water and windproof to keep the wearer warm in cold weather. The Midas Safety Hi-Vis Weather Guard Jacket is a versatile, high-quality workwear option that provides increased visibility and protection against harsh weather. The jacket features taped seams following the EN343 standard to prevent water penetration and conforms to EN20471 Hi-vis standards to ensure complete waterproofing and visibility in low-light environments. Additional features include a mesh ventilation flap at the back, a detachable hood, a quilted padded front, and reflective tapes to keep the wearer visible in low-light conditions.",
        "features": [
            "50 mm wide transverse fluorescent hi-visibility strips",
            "Padded shoulder finished with Hanging Hooks",
            "Bellows zip pockets at Vest Front with Pullers",
            "Hanging loops to attach keys or torch",
            "Snap button pockets",
            "Front DWR zipper closure",
            "Detachable tool pockets",
            "4-way stretch gusset",
            "Snap buttons and reflective segmented tapes",
            "12",
            "midassafety.com",
            "HI-VIS BENONI JACKET",
            "13",
            "midassafety.com",
            "Waterproof and Breathable fleece bonded softshell fabric",
            "Mesh-lined vents for better ventilation",
            "Stand-up collar with chin protection",
            "Two concealed side and chest pockets",
            "Detachable hood option",
            "50 mm wide Fluorescent reflective strips",
            "DWR Shell fabric and trims",
            "HI-VIS TORMUND JACKET",
            "DWR finish",
            "Hi-Visibility Reflective tapes",
            "Zip closure chest pocket for storage",
            "Multi-pocket design",
            "Quilt inside for comfort and warmth"
        ],
        "fabrics": [
            "Shell fabric: 100% Polyester mesh Hi-Vis Yellow, 120 GSM",
            "Contrast: 100% Polyester 150D softshell, 220 GSM",
            "Move Hi-Vis Shorts are designed for workers who need comfortable",
            "and durable clothing in hot and outdoor environments. Made with",
            "4-way stretch fabric that repels water and DWR zippers, these shorts",
            "keep you dry and your essentials safe.",
            "A 4-way stretch gusset allows for easy movement, so you can bend,",
            "flex, crouch, and climb with ease. Plus, generously sized front pockets,",
            "multi-functional zip thigh pockets, and removable holster pockets",
            "provide ample storage.",
            "Shell fabric: 100%polyester HiVis, 180 GSM",
            "Contrast: 4-way stretch 92% Nylon, 8% Spandex, 250 GSM",
            "94% Polyester 6% Spandex, 220 GSM",
            "100% polyester softshell, 275 GSM",
            "14",
            "midassafety.com",
            "HI-VIS GUARD JACKET",
            "Hi-Vis: 100% Polyester, 200 GSM",
            "Contrast: Navy 100% Polyester 2/2 Twill, 220 GSM",
            "Quilting: 100% Poly Quilting, 200 GSM",
            "15",
            "midassafety.com",
            "Full-length front zip",
            "Sealed seams",
            "Zip pocket on sleeve",
            "Back pocket vents with mesh for ventilation",
            "SUPER-BESTEN CONVERTIBLE",
            "TROUSER",
            "The Super Besten Convertible Trousers are the perfect combination of",
            "versatility, functionality, and comfort for year-round use. With hidden",
            "zippers, these cargo pants can easily transition from pants to shorts.",
            "The unique design also allows for conversion to industrial trousers",
            "with Co"
        ]
    },
    {
        "id": 84,
        "name": "MILITARY FIELD JACKET",
        "description": "The Military Utility Jacket is an ideal field jacket that was originally designed as a practical outer layer for military personnel to protect them from the elements. Our jacket is highly durable, tear-resistant, and practical to use. It includes a waist adjuster and a hand grip that adds to the convenience of carrying it in the field. This jacket is perfect for outdoor workers. It is made of classic fleece construction and features a quilted water-repellent overlay at the back. Additionally, it comes with an elbow mesh vent that offers breathability, and cozy hand pockets that provide added warmth. The Military Field Jacket is unbeatable in terms of warmth and provides full range of motion, making it ideal for individuals performing on the field. Our new Hybrid Hardshell Jacket combines athleisure with sustainability to create a jacket that is both eco-friendly and functional. Made from recycled materials, this jacket is breathable and perfect for protecting you from rain, wind, or snow during winter patrolling or camping trips. The durable fabric can handle abrasions from rocks, and the recycled jersey lining ensures comfort and warmth. Plus, the detachable Hi-vis yellow softshell sleeves can be easily zipped on and off depending on the weather. With front bellow pockets for keeping your essentials organized and hybrid recycled jersey bonded hardshell sleeves for a unique touch, the Hybrid Hardshell Jacket is a must-have for anyone looking for a sustainable, versatile, and comfortable jacket. Experience the warmth and style with the Nylon Work Jacket. Crafted with high-quality nylon, this jacket offers exceptional comfort, mobility, and protection against cold weather conditions. With its durable construction and functional design, it is the perfect choice for workers in the construction, patrolling, and mining sectors. The jacket features multiple pockets for storing tools and essentials, and its articulated sleeves allow for a full range of motion. Whether you’re working on a construction site or braving the cold on patrol, the Nylon Work Jacket will keep you warm, comfortable, and protected. jacket that’s easy to pack",
        "features": [
            "Arm vents with mesh-lined",
            "DWR zippers",
            "Soft fleece hood with drawcords for additional warmth",
            "Zipped hand pockets with soft pocket bag lining",
            "WEATHER",
            "PROTECTION",
            "HARDSHELL HYBRID WORK JACKET",
            "Recycled zippers and fabric materials",
            "Detachable, softshell Zip on and off-sleeves",
            "Breathable and comfortable fit",
            "Ribbed cuffs and Hem",
            "Zipper placket",
            "Lined with recycled interlock lining",
            "Tobacco thread stitches  with ribbed cuffs and hem",
            "60",
            "midassafety.com",
            "DURA SOFTSHELL JACKET",
            "Breathable waterproof fabric",
            "Extended fit  and length",
            "Zipper and Velcro at front placket",
            "Water-repellant zippers",
            "High neck collar",
            "Detachable hood",
            "4 front spacious pocket",
            "DWR-Zipper opening at trouser hem for ease of wearing",
            "61",
            "midassafety.com",
            "NYLON WORK JACKET",
            "100% Gabardine nylon",
            "Quilting inside",
            "DWR shell fabric",
            "Removeable hood",
            "Front pockets",
            "Boxy and slightly cropped fit",
            "STALWART WINDBREAKER"
        ],
        "fabrics": [
            "Shell: 100% Polyester-380 GSM",
            "Quilt: 100% Polyester-280 GSM",
            "Lining: Solid Single Jersey 100% Cotton 150 GSM",
            "Shell fabric: 100% Recycled Polyester PU membrane, 240 GSM",
            "Sleeves: 82% Recycled Nylon, 18% Spandex PU membrane, Recycled",
            "stretch fleece, 280 GSM",
            "Our DWR softshell fleece bonded Dura Softshell jacket is an ideal",
            "pick for workers performing outdoor tasks in cold environments. The",
            "Dura Softshell jacket is designed to offer, freedom of movement and",
            "breathability while withstanding the rigors of rain and wind. The stretch",
            "in the shell fabric provides unrestricted movement.",
            "Shell: 100% Elasticated Polyester TPU, 300 GSM",
            "Shell: 100% Gabardine Nylon, 300 GSM",
            "Lining: 100% Polyester Quilting, 200 GSM"
        ]
    },
    {
        "id": 85,
        "name": "Move HI-VIS SHORTS",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 86,
        "name": "MOVE SOFTSHELL JACKET",
        "description": "Midas Safety’s Move softshell jacket is the ideal choice for low- temperature work environments. With its waterproof softshell fleece- lined outer and contrasting high-vis colors, the jacket also features front zipper pockets and a full front closure to prevent water from entering keeping the wearer warm and comfortable for any outdoor job. Midas Safety has launched a new line of innovative weather-safe outerwear that combines athleisure style with safety features. The Reflective Guard Jacket is crafted with a gradient reflective fabric to ensure visibility in low-light conditions while maintaining sleek fit and modern look. This jacket is suitable for a wide range of activities and occasions, making it ideal for workers who need to be easily seen in low- light conditions. Its unique feature is the way it catches the light, reflecting a rainbow-like spectrum that is both eye-catching and practical for visibility. Stay protected and ride in style with our VentX Safety Windbreaker Jacket. This jacket features a waterproof zipper, a detachable and toggle-adjustable hood that can be detached and stored in the pocket inside, segmented reflective details for visibility in the dark at the front and back, waterproof zipper closure, and mesh vents at the front and back for breathability. Additionally, adjustable cuffs and hem keep unwanted drafts from creeping in. The durable, breathable fabric ensures a perfect fit, no matter the weather, making this jacket designed to keep the wearer comfortable and visible on any ride. The jacket, crafted from two technical materials, features a unique quilted front panel that offers a contrasting appearance and color scheme. Its ultra- lightweight and shiny front panel quilting provides a technical appeal and ensures an incredibly comfortable fit. The original design incorporates a quilted front, while the sleeves and back are made of stretchable contrasting fabrics, allowing for unrestricted movement. This jacket is not only warm and stylish but also offers a distinctive look for those who want to stand out. It boasts practical Midas Safety’s Waterproof Stretch W",
        "features": [
            "Centre front closure with full-length DWR zipper",
            "Detachable and toggle adjustable hood",
            "Bonded inside brushed fleece",
            "Segmented cut and sew for ease of movement",
            "Zip off detachable hood",
            "Multiple front pockets with contrasting hi-vis, waterproof zipper",
            "REFLECTIVE GUARD JACKET",
            "Centre front closure with full-length DWR zipper",
            "Detachable and toggle adjustable hood",
            "DWR Fabric",
            "Fleece fabric inside to ensure the wearer is warm",
            "adjustable hem and cuffs",
            "2 front pockets with waterproof zipper",
            "Shell fabric: 94% Polyester, 6% Spandex TPU Softshell Fleece, 240 GSM",
            "67",
            "midassafety.com",
            "VENTX  SAFETY WINDBREAKER",
            "JACKET",
            "Segmented reflective for visibility in the dark",
            "DWR Zippers",
            "Mesh vents for breathability",
            "Waterproof, TPU membrane finished fabric",
            "Snap buttons to adjust the helmet as per convenience",
            "High Rise Collar for Extra Wind Protection",
            "GUARD 2TONE STRETCH JACKET",
            "large zipped pockets. The water-repellent and down-proof fabric ensures",
            "maximum comfort and style during the cold season, making this jacket a perfect",
            "choice for anyone seeking both warmth and fashion.",
            "Stretch fabrics for mobility",
            "Drawcord and toggle adjuster hood",
            "DWR Zippers",
            "Front pocket",
            "Cut and sew for an ergonomic fit",
            "Shell fabric: 50D High Elastic plain, 100, 60D, 75 GSM",
            "Finishing: TPU Clear membrane 3K/5K",
            "68",
            "midassafety.com",
            "DWR FLEXI FORCE JACKET"
        ],
        "fabrics": [
            "Shell fabric: 100% Polyester, 185 GSM",
            "Fleece Inner: 100% GRS recycled Polyester, 240 GSM",
            "Shell fabric: 92%polyester, 75D*75D*300D and 8%spandex75D/40D*75D/40D/300D -260 GSM",
            "Black contrast: 75D/40D*75D/40D/300D, 92% Polyester and 8% Spandex-190 GSM",
            "Quilting Front Panel: 100% Polyester"
        ]
    },
    {
        "id": 87,
        "name": "Nami Fleece jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 88,
        "name": "NORD JACKET",
        "description": "The Midas Filan Softshell trouser is a perfect companion when weath- er conditions get tough. This lightweight softshell trouser is extremely soft, comfortable, and flexible. The trouser is two toned with contrasting colors in exposed areas for optimal visibility. Additionally, the kneepad pockets of durable CORDURA are adjustable to allow optimal position setting on your knees.",
        "features": [
            "hunting and fishing industry.",
            "Utility inspired Front pockets and dropped shoulder and wide boxy",
            "fit reflects a 80’s/90’s aesthetic sense while keeping movement in",
            "mind. Equipped with mesh lining and easy to open zipper and Velcro",
            "Front placket, this jacket features a Velcro placket with full zip closure",
            "and a stand collar.",
            "Shell: 75% Cotton, 25% Nylon 200gsm|5.9oz",
            "Mesh: 80%Polyamide 20% Elastane",
            "A high-performance hunting and Fishing jacket with Oil and",
            "water repellant finish",
            "Made from Polyamide mesh for breathability",
            "Pocket storage capacity with flap pockets",
            "Front Zipper and Velcro placket",
            "Loose and wide fit",
            "53",
            "midassafety.com",
            "NYCO TOUGH-INDUSTRIAL COVERALL",
            "Multipurpose Bellow zip pockets at Front and Arm sides",
            "Detachable, Hood Classic Zip opening at the front placket",
            "Drawstring  and Toggle adjusted hood and Hem",
            "Sleeve Pocket with Velcro adjustable cuffs",
            "Front zipper closure",
            "HUNTING VEST",
            "Light weight vest",
            "Adjustable shoulder straps",
            "Suspender adjuster with webbing",
            "Adjustable belt in width",
            "Pockets for small objects",
            "Two large front pockets",
            "One back pocket to store tools",
            "54",
            "midassafety.com",
            "DURA SOFTSHELL TROUSER",
            "Breathable, waterproof and seam-sealed construction",
            "Fully Tapped seams to keep the water out",
            "Snap button opening",
            "Elastic waistband",
            "Snap closure",
            "Zipper opening at trouser hem for ease of wearing",
            "Water-repellent zippers",
            "Flap pockets on both sides",
            "Cordura patch at knee",
            "FILAN TROUSER",
            "Waterproof and breathable softshell fabric made up of",
            "Polyester Span- dex & Fleece combination",
            "Double stitched seams on leg and crotch. Low waist",
            "Fly with zip",
            "2 spacious concealed side pockets & 2 thigh pockets with a",
            "flap",
            "2 concealed back pocket"
        ],
        "fabrics": [
            "Our Nord Utility jacket is crafted from proprietary High Shrunk",
            "Nylon and cotton for a durable and lightweight finish. This jacket",
            "is incorporated with Polyamide mesh for breathability with added",
            "Hard work comes easy in our Nyco Tough-coverall . This technical",
            "coverall is purpose built to be worn while conducting direct action",
            "tasks. Its Fit achieves two-piece mobility with a full range of",
            "unrestricted movement.  This coverall is built with a nylon cotton blend",
            "enable comfort in getting the work done. It features reinforced elbow",
            "patches, two Hollister pockets and elasticated waist.",
            "60% Cotton, 40% Nylon tufted 260gsm|7.7oz",
            "Our canvas hunting vest is a featured piece to carry on fishing or",
            "hunting. It is made of canvas fabric with edges adjusted with belts and",
            "suspender which go with the shoulder straps that can be adjusted in",
            "length to meet different outdoor needs.",
            "100% cotton 240gsm|7oz",
            "Our DWR softshell ,fleece bonded Dura trousers are designed for",
            "weather protection, freedom of movement and breathability. The",
            "knees are protected by CORDURA® patch: a strong, light weight,",
            "rugged and hardwearing waterproof fabric which allows you",
            "to move dynamically in comfort, with little restriction. It is ideal",
            "for protection from high-exertion working in challenging and",
            "changeable environments. It features fully taped seams at ankle-",
            "to-knee zipper closures, a comfort waistband for flexible movement,",
            "and hip-to-thigh snap closures for easy entry and removal.",
            "Shell: 100% Elasticated Polyester TPU, 75D fleece 260gsm|7.7oz",
            "Mesh: 92% Nylon and 08% Elastane DWR",
            "Shell: 94% Polyester, 6% Spandex, 240 GSM"
        ]
    },
    {
        "id": 89,
        "name": "NORD RECYCLED TEDDY FLEECE JACKET",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 90,
        "name": "NOVA RECYCLED FLEECE JACKET",
        "description": "Stay warm and comfortable with our Nova Recycled Fleece jacket. Made from soft, deep-pile 100% recycled polyester and finished with several practical features. The jacket features a boxy fit, striking contrast, 2 side pockets, and a practical high neck with long sleeves and elasticated edging. Made from high-quality recycled polyester, it not only offers a trendy look but also actively contributes to reducing waste and environmental pollution. Stay cozy and stylish with the Nord Teddy fleece jacket. This premium garment features a soft, high-pile exterior and a breathable lining for optimal warmth. The contrasting black fabric adds a classic touch, while practical details like zippers, a chin guard, and wind protection ensure comfort and functionality. The spacious pockets provide convenient storage and keep your hands warm, making this jacket a must-have for cold-weather adventures. The jacket, crafted from two technical materials, features a unique quilted front panel that offers a contrasting appearance and color scheme. Its ultra- lightweight and shiny front panel quilting provides a technical appeal and ensures an incredibly comfortable fit. The original design incorporates a quilted front, while the sleeves and back are made of stretchable contrasting fabrics, allowing for unrestricted movement. This jacket is not only warm and stylish but also offers a distinctive look for those who want to stand out. It boasts practical Introducing a Reversible quilted parka perfect for fall. This parka This innovative weather-safe outerwear combines athleisure style with safety features. The jacket is crafted with a gradient reflective",
        "features": [
            "Elasticated hem and sleeve",
            "Front side pockets",
            "1 Inside and 2 side pockets to store the essentials",
            "100% GRS Recycled Polyester",
            "Shell fabric: 94% Polyester, 6% Spandex TPU Softshell Fleece, 240 GSM",
            "69",
            "midassafety.com",
            "NORD RECYCLED TEDDY FLEECE",
            "JACKET",
            "Elasticated hem and sleeve",
            "Inside pockets to store the essentials",
            "GRS Certified 100% Recycled fabric",
            "WEATHERPROOF MAVERICK JACKET",
            "large zipped pockets. The water-repellent and down-proof fabric ensures",
            "maximum comfort and style during the cold season, making this jacket a perfect",
            "choice for anyone seeking both warmth and fashion.",
            "Stretch fabrics for mobility",
            "Drawcord and toggle adjuster hood",
            "DWR Zippers",
            "Front pocket",
            "Cut and sew for an ergonomic fit",
            "Shell fabric: 100% Recycled Polyester, 240 GSM",
            "70",
            "midassafety.com",
            "REVERSIBLE QUILTED PARKA",
            "construction to keep you dry in any weather. The quilted interior",
            "provides extra warmth, and the reversible style offers a sporty and",
            "urban twist on the classic quilted look. The parka has an elegant, slightly",
            "relaxed fit, making it ideal for layering over basic work attire without",
            "sacrificing style. It also includes a center-front zipper with a hidden-",
            "button storm flap, snap buttoned hood, and multiple pockets with",
            "contrasting colors to store the essentials.",
            "Centre front closure with full-length DWR zipper",
            "One side in cotton flannel, the other in quilted polyester.",
            "Chest pocket and two front pockets with clasp.",
            "Comfortable ribbed polyester cuffs and collar.",
            "Snap button detachable hood",
            "Multiple top and inside pockets",
            "Internal chest cell phone pocket on the left-hand side",
            "Shell fabric: 40% Polyester, 60% Cotton, DWR, 240 GSM",
            "100% Polyester, quilted 180 GSM",
            "71",
            "midassafety.com",
            "SPECTRO JACKET"
        ],
        "fabrics": [
            "Shell fabric: 100% GRS recycled Polyester, 240 GSM",
            "Shell fabric: 90%Nylon,10%Spandex-300 Gsm",
            "Hi-Vis contrast: 75D/40D*75D/40D/300D, 92% Polyester and 8% Spandex-190 GSM",
            "Quilting Front Panel: 100% cotton 210 GSM",
            "sleek and modern look."
        ]
    },
    {
        "id": 91,
        "name": "Nyco Industrial Jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 92,
        "name": "NYCO TOUGH-INDUSTRIAL COVERALL",
        "description": "The Midas Filan Softshell trouser is a perfect companion when weath- er conditions get tough. This lightweight softshell trouser is extremely soft, comfortable, and flexible. The trouser is two toned with contrasting colors in exposed areas for optimal visibility. Additionally, the kneepad pockets of durable CORDURA are adjustable to allow optimal position setting on your knees. Midas Barrington Trousers have been designed with your modern work in mind. The slim fit trouser has been ergonomically constructed with comfortable fabrication to ensure that your mobility is maximized. Strong CORDURA® fabric has been used for reinforcement at knees to enhance durability. You’ll be performing at your best with all your necessities within reach with two front holster pockets to securely carry your most essential gear. The functional build also includes pockets for inserting your knee pads, multiple utility pockets for storing your essentials. Reflective trim is highlighted throughout the pants, keeping you safe and visible in your work environment specially in the fields of Construction, Logistic and Services.",
        "features": [
            "Multipurpose Bellow zip pockets at Front and Arm sides",
            "Detachable, Hood Classic Zip opening at the front placket",
            "Drawstring  and Toggle adjusted hood and Hem",
            "Sleeve Pocket with Velcro adjustable cuffs",
            "Front zipper closure",
            "HUNTING VEST",
            "Light weight vest",
            "Adjustable shoulder straps",
            "Suspender adjuster with webbing",
            "Adjustable belt in width",
            "Pockets for small objects",
            "Two large front pockets",
            "One back pocket to store tools",
            "54",
            "midassafety.com",
            "DURA SOFTSHELL TROUSER",
            "Breathable, waterproof and seam-sealed construction",
            "Fully Tapped seams to keep the water out",
            "Snap button opening",
            "Elastic waistband",
            "Snap closure",
            "Zipper opening at trouser hem for ease of wearing",
            "Water-repellent zippers",
            "Flap pockets on both sides",
            "Cordura patch at knee",
            "FILAN TROUSER",
            "Waterproof and breathable softshell fabric made up of",
            "Polyester Span- dex & Fleece combination",
            "Double stitched seams on leg and crotch. Low waist",
            "Fly with zip",
            "2 spacious concealed side pockets & 2 thigh pockets with a",
            "flap",
            "2 concealed back pockets",
            "Adjustable kneepad pockets in durable CORDURA",
            "50 mm wide Fluorescent reflective strips on body",
            "55",
            "midassafety.com",
            "SILVANUS TROUSER",
            "WORK UTILITY PANTS"
        ],
        "fabrics": [
            "Hard work comes easy in our Nyco Tough-coverall . This technical",
            "coverall is purpose built to be worn while conducting direct action",
            "tasks. Its Fit achieves two-piece mobility with a full range of",
            "unrestricted movement.  This coverall is built with a nylon cotton blend",
            "enable comfort in getting the work done. It features reinforced elbow",
            "patches, two Hollister pockets and elasticated waist.",
            "60% Cotton, 40% Nylon tufted 260gsm|7.7oz",
            "Our canvas hunting vest is a featured piece to carry on fishing or",
            "hunting. It is made of canvas fabric with edges adjusted with belts and",
            "suspender which go with the shoulder straps that can be adjusted in",
            "length to meet different outdoor needs.",
            "100% cotton 240gsm|7oz",
            "Our DWR softshell ,fleece bonded Dura trousers are designed for",
            "weather protection, freedom of movement and breathability. The",
            "knees are protected by CORDURA® patch: a strong, light weight,",
            "rugged and hardwearing waterproof fabric which allows you",
            "to move dynamically in comfort, with little restriction. It is ideal",
            "for protection from high-exertion working in challenging and",
            "changeable environments. It features fully taped seams at ankle-",
            "to-knee zipper closures, a comfort waistband for flexible movement,",
            "and hip-to-thigh snap closures for easy entry and removal.",
            "Shell: 100% Elasticated Polyester TPU, 75D fleece 260gsm|7.7oz",
            "Mesh: 92% Nylon and 08% Elastane DWR",
            "Shell: 94% Polyester, 6% Spandex, 240 GSM",
            "Shell: 98% Organic Cotton, 2% Elastane,"
        ]
    },
    {
        "id": 93,
        "name": "NYCO TOUGH-INDUSTRIAL JACKET",
        "description": "",
        "features": [
            "Multi Purpose, Functional Bellow zip pockets at Front and Arm",
            "sides",
            "Detachable, Hood Classic Zip opening at the front placket",
            "Sleeve Pocket with Velcro adjustable cuffs",
            "Classic Zip opening , finished with logo tag",
            "High cotton content for comfort and breathability",
            "Authentic look of classic woven cotton",
            "Water repellant",
            "Multipurpose Bellow zip pockets at Front",
            "Detachable, Fur Hood",
            "Classic Zip opening at the front placket with finished logo tag",
            "High cotton content for comfort",
            "Authentic look of classic woven cotton",
            "Double layered vest in contrasting colors",
            "Quilt attached",
            "51",
            "midassafety.com",
            "BINARY CONVERTIBLE PANTS",
            "Oil and water repellent",
            "Zip off convertible shorts",
            "Stretchable Cordura for ease of movement",
            "Zipper leg opening",
            "Hook/Loop attached to waist",
            "Multiple pockets",
            "Reinforcement",
            "Two front and two side pockets",
            "52",
            "midassafety.com",
            "NORD JACKET",
            "hunting and fishing industry.",
            "Utility inspired Front pockets and dropped shoulder and wide boxy",
            "fit reflects a 80’s/90’s aesthetic sense while keeping movement in",
            "mind. Equipped with mesh lining and easy to open zipper and Velcro",
            "Front placket, this jacket features a Velcro placket with full zip closure",
            "and a stand collar.",
            "Shell: 75% Cotton, 25% Nylon 200gsm|5.9oz",
            "Mesh: 80%Polyamide 20% Elastane",
            "A high-performance hunting and Fishing jacket with Oil and",
            "water repellant finish",
            "Made from Polyamide mesh for breathability",
            "Pocket storage capacity with flap pockets",
            "Front Zipper and Velcro placket",
            "Loose and wide fit",
            "53",
            "midassafety.com",
            "NYCO TOUGH-INDUSTRIAL COVERALL"
        ],
        "fabrics": [
            "Our Dual industrial-jacket is perfect for any worksite. Featuring jacket",
            "made of sturdy Cotton Poly blend fabric that can keep up with the",
            "toughness you need to take on a rugged workday. Multi Pocket with",
            "added vest engineers’ extra durability right where you need it most.",
            "Hard work comes easy in our Nyco Tough-Jacket . Workwear transforms",
            "the classic work apparel by utilizing advanced fabrics, reinforced",
            "stitching and ergonomically designed gussets. Our Nyco Jackets are built",
            "with a nylon cotton blend fabric that is water repellent, stain resistant",
            "and compact in size to get work done easily. It features reinforced elbow",
            "patches, wide gusseted armpits, hidden button-down collar and angled",
            "pockets for easy access.",
            "Shell: 65% Cotton, 35% Polyester 200gsm|9.4oz",
            "Quilting: 100% Polyester 2x3 110gsm|3.2oz",
            "60% Cotton, 40% Nylon tufted 260gsm|7.7oz",
            "Our Binary convertible pants have zip-off legs to make it easy to",
            "switch between trousers and shorts. Carry for the weather with these",
            "quick dry zip-off cargo pants/shorts. They keep you warm, protected",
            "and dries out quickly if it gets wet. These high-rated convertible pants/",
            "shorts are flexible to work in variety of conditions. Pair them with other",
            "cold-weather outerwear to keep your full body warm.",
            "Besides being easy to convert from trousers to shorts they have",
            "several features that will make them a staple of your workwear",
            "uniform. The ankle cuffs are adjustable with zippers which makes them",
            "easy to put on and take off without removing your shoes. The material",
            "at the knees, ankles and seat is stretchable and suited for different",
            "postures. The trousers have one back pocket, two front pockets with",
            "zips and one zipped leg pocket.",
            "Shell: 65% recycled polyester , 35% cotton, 200 gsm | 5.9oz",
            "Cordura: 4 way stretch patch on knees: 92% Nylon, 8% Spandex",
            "Our Nord Utility jacket is crafted from proprietary High Shrunk",
            "Nylon and cotton for a durable and lightweight finish. This jacket",
            "is incorporated with Polyamide mesh for breathability with added",
            "Hard work comes easy in our Nyco Tough-coverall . This technical",
            "coverall is purpose built to be worn while conducting direct action",
            "tasks. Its Fit achieves t"
        ]
    },
    {
        "id": 94,
        "name": "Nylon work jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 95,
        "name": "Performer Utility Jacket",
        "description": "The Briskly Rider Jacket is specifically designed to keep riders safe and protected while on the road. Its Kevlar shell provides exceptional protection for the elbows and shoulders and is reinforced with CE approved padding to prevent injuries in case of a fall. The jacket’s Kevlar shell also acts as a protective barrier between the rider’s skin and the road surface in case of an accident where the rider or pillion passenger falls from the motorcycle and slides along the road. For added comfort and protection, the jacket features a knitted 100% Meta-Aramid lining that offers excellent thermal stability, flame resistance, electrical insulation, chemical stability, and radiation resistance. Our workwear cargo pants are made from recycled polyester and cotton, making them both sustainable and durable. They are also designed with large side pockets for convenience and a knee 4-way stretch patch for unrestricted movement. These pants are perfect for working in outdoor, sunny work environments, and will help you perform your best. Our Nami Hybrid Fleece and Quilting Women’s Jacket features a range of versatile features and a sleek design, this jacket is the perfect choice for females in services industries to stay comfortable and warm while working. Constructed from durable ripstop polyester, it can withstand wind and tears, while the dirt-repellent woven surface ensures a professional appearance. The overlapping quilted pocket at the back and breathable materials make it effortless to tackle rain, mud, and dirt without feeling weighed down or uncomfortable.",
        "features": [
            "Arm vents with mesh-lined",
            "DWR zippers",
            "Soft fleece hood with drawcords for additional warmth",
            "Zipped hand pockets with soft pocket bag lining",
            "BRISKLY RIDER JACKET",
            "Durable and strong fabric materials",
            "Puncture resistant",
            "Kevlar and Knitted Meta Aramid jacket",
            "Side zipper openings for ease in carrying it off",
            "Front DWR Zipper placket opening",
            "3 front spacious pockets",
            "Spacious, multi-purpose zipper plain pocket",
            "AA tear and abrasion resistance rating",
            "3 spacious front and one back pocket for storage",
            "Straight High neck collar",
            "42",
            "midassafety.com",
            "TITAN WORK PANTS",
            "Straight fit",
            "4-Way stretch panel",
            "Snap button flap cargo pockets",
            "Recycled material fabric",
            "HI-VIS FLEECE JACKET",
            "DWR zippers",
            "Elasticated cuffsDrawcord adjusted hem",
            "Back storage pocket",
            "Detachable hood",
            "Soft fleece hood with drawcords for additional warmth",
            "Reflective piping",
            "Zipped hand pockets with soft pocket bag lining",
            "Made from durable ripstop polyester to combat wind & tear",
            "43",
            "midassafety.com",
            "44",
            "midassafety.com",
            "MAVEN UTILITY CARGO",
            "PANTS"
        ],
        "fabrics": [
            "Shell: 100% Polyester Quilt, 280 GSM",
            "Contrast: 80% Cotton, 20% Polyester Fleece, 280 GSM",
            "Lining: Solid Single Jersey 100% Cotton, 150 GSM",
            "Rib: Camo printed Rib 1x1, 97% Cotton, 3% Spandex, 425 GSM",
            "Shell: 83% Nylon, 12% Kevlar, 5% Elastane, 300GSM",
            "Lining: 100% Para-Aramid, 270 GSM",
            "Shell: 65% recycled-polyester ,35%Cotton, 245 GSM",
            "Contrast: 4 way-stretch, 92% Nylon, 8% Spandex, 250 GSM",
            "Shell: 100% ripstop Polyester quilt, 280 GSM",
            "Contrast: 80% Cotton, 20% Polyester, Fleece, 280 GSM",
            "Lining: Solid Single Jersey, 100% Cotton, 150 GSM",
            "Our Maven Utility Cargo Pants are made of cotton-poly duck",
            "weave fabric, which is both versatile and durable."
        ]
    },
    {
        "id": 96,
        "name": "PRO-Advanced weather shield jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 97,
        "name": "Reddy Active light jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 98,
        "name": "REFLECTIVE GUARD JACKET",
        "description": "Midas Safety has launched a new line of innovative weather-safe outerwear that combines athleisure style with safety features. The Reflective Guard Jacket is crafted with a gradient reflective fabric to ensure visibility in low-light conditions while maintaining sleek fit and modern look. This jacket is suitable for a wide range of activities and occasions, making it ideal for workers who need to be easily seen in low- light conditions. Its unique feature is the way it catches the light, reflecting a rainbow-like spectrum that is both eye-catching and practical for visibility. Stay protected and ride in style with our VentX Safety Windbreaker Jacket. This jacket features a waterproof zipper, a detachable and toggle-adjustable hood that can be detached and stored in the pocket inside, segmented reflective details for visibility in the dark at the front and back, waterproof zipper closure, and mesh vents at the front and back for breathability. Additionally, adjustable cuffs and hem keep unwanted drafts from creeping in. The durable, breathable fabric ensures a perfect fit, no matter the weather, making this jacket designed to keep the wearer comfortable and visible on any ride. The jacket, crafted from two technical materials, features a unique quilted front panel that offers a contrasting appearance and color scheme. Its ultra- lightweight and shiny front panel quilting provides a technical appeal and ensures an incredibly comfortable fit. The original design incorporates a quilted front, while the sleeves and back are made of stretchable contrasting fabrics, allowing for unrestricted movement. This jacket is not only warm and stylish but also offers a distinctive look for those who want to stand out. It boasts practical Midas Safety’s Waterproof Stretch Workwear Jacket is the perfect option for working in low-temperature environments. This jacket has a waterproof, membrane-lined exterior to keep you protected during moderate rain and wind while working outdoors. The contrasting reflective accent ensures visibility in low-light conditions. Front pockets provide convenient storage for essentials, while the full front DWR zipper closure prevents water from entering.",
        "features": [
            "Centre front closure with full-length DWR zipper",
            "Detachable and toggle adjustable hood",
            "DWR Fabric",
            "Fleece fabric inside to ensure the wearer is warm",
            "adjustable hem and cuffs",
            "2 front pockets with waterproof zipper",
            "Shell fabric: 94% Polyester, 6% Spandex TPU Softshell Fleece, 240 GSM",
            "67",
            "midassafety.com",
            "VENTX  SAFETY WINDBREAKER",
            "JACKET",
            "Segmented reflective for visibility in the dark",
            "DWR Zippers",
            "Mesh vents for breathability",
            "Waterproof, TPU membrane finished fabric",
            "Snap buttons to adjust the helmet as per convenience",
            "High Rise Collar for Extra Wind Protection",
            "GUARD 2TONE STRETCH JACKET",
            "large zipped pockets. The water-repellent and down-proof fabric ensures",
            "maximum comfort and style during the cold season, making this jacket a perfect",
            "choice for anyone seeking both warmth and fashion.",
            "Stretch fabrics for mobility",
            "Drawcord and toggle adjuster hood",
            "DWR Zippers",
            "Front pocket",
            "Cut and sew for an ergonomic fit",
            "Shell fabric: 50D High Elastic plain, 100, 60D, 75 GSM",
            "Finishing: TPU Clear membrane 3K/5K",
            "68",
            "midassafety.com",
            "DWR FLEXI FORCE JACKET",
            "Elasticated cuffs",
            "DWR Zippers on front closure and pockets",
            "Reflective mesh vents",
            "Detachable and toggle adjustable hood",
            "Bonded inside brushed fleece",
            "Segmented cut and sew for ease of movement",
            "Zip off detacha"
        ],
        "fabrics": [
            "Shell fabric: 100% Polyester, 185 GSM",
            "Fleece Inner: 100% GRS recycled Polyester, 240 GSM",
            "Shell fabric: 92%polyester, 75D*75D*300D and 8%spandex75D/40D*75D/40D/300D -260 GSM",
            "Black contrast: 75D/40D*75D/40D/300D, 92% Polyester and 8% Spandex-190 GSM",
            "Quilting Front Panel: 100% Polyester"
        ]
    },
    {
        "id": 99,
        "name": "REVERSIBLE QUILTED PARKA",
        "description": "Introducing a Reversible quilted parka perfect for fall. This parka This innovative weather-safe outerwear combines athleisure style with safety features. The jacket is crafted with a gradient reflective Midas Safety’s freezer coveralls are designed to keep you warm and protected in harsh work environments. The suit features heavy-duty zippers and wind-resistant flaps to keep out the elements, allowing you to focus on your work without worrying about freezing temperatures or moisture. Whether you’re working in cold storage, processing frozen food, or handling goods in refrigerated trucks, this insulated suit offers superior protection. It is designed with reinforced stitching, side leg snaps for easy boot access, and a full front DWR zipper closure to prevent water from entering. These freezer suits also come with deep pockets for convenient storage of tools and personal items, and an optional snap-on hood for full head coverage when needed. The double-reinforced stitching in high-stress areas ensures durability, while the wind-tight, water-repellent fabric keeps you warm and dry even in the most frigid conditions. The Tencel cargo pants are made with soft, breathable Tencel",
        "features": [
            "construction to keep you dry in any weather. The quilted interior",
            "provides extra warmth, and the reversible style offers a sporty and",
            "urban twist on the classic quilted look. The parka has an elegant, slightly",
            "relaxed fit, making it ideal for layering over basic work attire without",
            "sacrificing style. It also includes a center-front zipper with a hidden-",
            "button storm flap, snap buttoned hood, and multiple pockets with",
            "contrasting colors to store the essentials.",
            "Centre front closure with full-length DWR zipper",
            "One side in cotton flannel, the other in quilted polyester.",
            "Chest pocket and two front pockets with clasp.",
            "Comfortable ribbed polyester cuffs and collar.",
            "Snap button detachable hood",
            "Multiple top and inside pockets",
            "Internal chest cell phone pocket on the left-hand side",
            "Shell fabric: 40% Polyester, 60% Cotton, DWR, 240 GSM",
            "100% Polyester, quilted 180 GSM",
            "71",
            "midassafety.com",
            "SPECTRO JACKET",
            "Centre front closure with full-length DWR zipper",
            "Detachable and toggle adjustable hood",
            "DWR Fabric",
            "Sustainable, Recycled Fleece fabric inside to ensure the wearer",
            "stays warm",
            "2 side pockets with waterproof zipper and  reflective piping details",
            "Cut & sew details for an ergonomic fit",
            "FREEZER WEAR COVERALL",
            "Taped seams",
            "Reflective accent piping",
            "Heavy Quilting Inside",
            "Segmented cut and sew for ease of movement",
            "Zip off detachable hood",
            "50 degrees of protection, -46 Celsius cold comfort",
            "Shell fabric: 100% Polyester, 185 GSM",
            "Fleece Inner: 100% GRS recycled Polyester, 240 GSM",
            "SERVICES",
            "TENCEL CARGO PANTS",
            "TERRA OVERLAY SHIRT"
        ],
        "fabrics": [
            "sleek and modern look. The Reflective Guard Jacket is suitable for a",
            "wide range of activities and occasions, making it ideal for workers",
            "who need to be easily seen in low-light conditions. Its unique feature",
            "is the way it catches the light, reflecting a rainbow-like spectrum",
            "that’s both eye-catching and practical for visibility. This amazing",
            "rainbow reflective jacket looks grey and unassuming until the light",
            "hits it, and then it takes on a bright rainbow glow. Our Reflective",
            "jacket is perfect for everything from athleisure wear to outdoor or",
            "safety wear for activities like cycling or riding a motorbike at night.",
            "Shell fabric: 40% Polyester, 60% 40Cotton DWR, 240 GSM",
            "100 Polyester Quilting- 250 GSM",
            "convenience. The classic beige color adds a touch of sophistication to",
            "any service wardrobe. Plus, with a blend of cotton and Spandex, these",
            "pants offer both comfort and flexibility for unrestric"
        ]
    },
    {
        "id": 100,
        "name": "Row 91 Athena Hivis jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 101,
        "name": "RUHE SCRUBS SET",
        "description": "",
        "features": [
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "2 side pockets",
            "Straight-fit trousers",
            "Multiple bottom pockets",
            "Lightweight and long-lasting",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "2 side pockets",
            "Straight-fit trousers",
            "83",
            "midassafety.com",
            "Shell:  65% Polyester, 35% Cotton, 2/1 Twill, 160 GSM",
            "CUT",
            "RESISTANT",
            "85",
            "midassafety.com",
            "CUT RESISTANT-SWEATSHIRT",
            "Made up of a blend of Polyester yarn, Glass Fibers, UHMWPE (Ul-",
            "tra High Molecular Weight Polyethylene), Spandex & Coolmax",
            "Jackets & pullovers are made in a 12gg machine while aprons",
            "being made in 7gg machine",
            "Highly breathable and comfortable PPE garment",
            "High neck protection with Coolmax to provide maximum",
            "comfort",
            "Sleeves available in thumb loop and thumbhole",
            "Provided with webbings and lock for improved grip",
            "Protection Levels as Per ASTM – F2992",
            "Pullover: Body (A3), Rib (A6), Interlock & Neck (A7)",
            "Shirts: Body (A3) & Rib (A5)",
            "Aprons: Body (A9)",
            "86",
            "midassafety.com",
            "CUT RESISTANT-SWEATSHIRT",
            "Made up of a blend of Polyester yarn, Glass Fibers, UHMWPE",
            "(Ultra High Molecular Weight Polyethylene), Spandex &",
            "Coolmax",
            "Jackets & pullovers are made in a 12gg machine while",
            "aprons being made in 7gg machine",
            "Highly breathable and comfortable PPE garment",
            "High neck protection with Coolmax to provide maximum",
            "comfort",
            "Sleeves available in thumb loop and thumbhole",
            "Provided with webbings and lock for improved grip",
            "Protection Levels as Per ASTM – F2992",
            "Pullover: Body (A3), Rib (A6), Interlock & Neck (A7)",
            "Shirts: Body (A3) & Rib (A5)",
            "Aprons: Body (A9)",
            "87",
            "midassafety.com",
            "CHAINSAW BIB PANTS",
            "Metal D-ring to keep essential items readily accessible",
            "Ideal for Forestry, Logging, Construction, Glass industry, Agriculture",
            "Reflective details",
            "Cut resistant padding on thigh and knee -"
        ],
        "fabrics": [
            "Add a touch of excitement to your hectic workday with our Two-Tone",
            "Medical Scrub. This flattering-fit set features a V-neck and short sleeves",
            "for a stylish and professional look. The matching pants have an elastic",
            "waist for long-lasting comfort during your shift.",
            "Whether you’re a doctor, nurse, or other healthcare professional, our",
            "Two-Tone Medical Scrub is the perfect choice for those who want to look",
            "and feel their best while on the job.",
            "Shell:  50% Cotton, 50% Polyester, 190 GSM",
            "33% UHMWPE, 58% Nylon, 8% Glass, 1% Spandex",
            "35% UHMWPE, 30% Polyester, 2% Spandex, Coolmax",
            "Midas Cut Resistant Clothing is designed to provide protection to workers",
            "in the glass, industrial manufacturing, and food processing industries. It",
            "provides protection to the body to mitigate the risk of cut injuries while being",
            "comfortable in workshops and industrial environments.",
            "Our Cut Resistant clothing has a wide range of products including pullovers,",
            "aprons, chaps and sleeves conforming from A3 to A9 levels of protection",
            "classes.",
            "Garments are made up of breathable Coolmax technology to provide",
            "comfort.",
            "Midas Cut Resistant Clothing is designed to provide protection to",
            "workers in the glass, industrial manufacturing, and food processing",
            "industries. It provides protection to the body to mitigate the risk of",
            "cut injuries while being comfortable in workshops and industrial",
            "environments.",
            "Our Cut Resistant clothing has a wide range of products including",
            "pullovers, aprons, chaps and sleeves conforming from A3 to A9 levels of",
            "protection classes.",
            "Garments are made up of breathable Coolmax technology to provide",
            "comfort.",
            "33% UHMWPE, 58% Nylon, 8% Glass, 1% Spandex",
            "35% UHMWPE, 30% Polyester, 2% Spandex, Coolmax",
            "Designed with the specific needs of tree care professionals in mind, our",
            "Chainsaw Overalls offer unparalleled protection against chainsaw-related",
            "injuries. These bib pants are constructed from heavy-duty, cut-resistant",
            "materials that can withstand the force of a chainsaw blade, providing you",
            "with peace of mind while working with sharp blades or hazardous conditions."
        ]
    },
    {
        "id": 102,
        "name": "SERGE ZTONE INDUSTRIAL PANTS",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 103,
        "name": "Silvanus trouser",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 104,
        "name": "Softshell Weather shield jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 105,
        "name": "SPECTRO JACKET",
        "description": "This innovative weather-safe outerwear combines athleisure style with safety features. The jacket is crafted with a gradient reflective Midas Safety’s freezer coveralls are designed to keep you warm and protected in harsh work environments. The suit features heavy-duty zippers and wind-resistant flaps to keep out the elements, allowing you to focus on your work without worrying about freezing temperatures or moisture. Whether you’re working in cold storage, processing frozen food, or handling goods in refrigerated trucks, this insulated suit offers superior protection. It is designed with reinforced stitching, side leg snaps for easy boot access, and a full front DWR zipper closure to prevent water from entering. These freezer suits also come with deep pockets for convenient storage of tools and personal items, and an optional snap-on hood for full head coverage when needed. The double-reinforced stitching in high-stress areas ensures durability, while the wind-tight, water-repellent fabric keeps you warm and dry even in the most frigid conditions. The Tencel cargo pants are made with soft, breathable Tencel hoosing the right workwear is essential for staying comfortable & productive all day long, especi",
        "features": [
            "Centre front closure with full-length DWR zipper",
            "Detachable and toggle adjustable hood",
            "DWR Fabric",
            "Sustainable, Recycled Fleece fabric inside to ensure the wearer",
            "stays warm",
            "2 side pockets with waterproof zipper and  reflective piping details",
            "Cut & sew details for an ergonomic fit",
            "FREEZER WEAR COVERALL",
            "Taped seams",
            "Reflective accent piping",
            "Heavy Quilting Inside",
            "Segmented cut and sew for ease of movement",
            "Zip off detachable hood",
            "50 degrees of protection, -46 Celsius cold comfort",
            "Shell fabric: 100% Polyester, 185 GSM",
            "Fleece Inner: 100% GRS recycled Polyester, 240 GSM",
            "SERVICES",
            "TENCEL CARGO PANTS",
            "TERRA OVERLAY SHIRT",
            "Patch pocket on the chest with stud-secure flap",
            "Working cuff with button fastening",
            "Loose straight fit with a cut and sew",
            "Peach finished, Soft hand feel",
            "Eco-friendly material",
            "Stretchy, Soft hand feel",
            "Straight-fit pants",
            "Hook and bar closure with zip fly",
            "Slash pockets at the front",
            "Side flap patch pockets at legs",
            "73",
            "midassafety.com",
            "ECO-FLEECE WORK JACKET"
        ],
        "fabrics": [
            "sleek and modern look. The Reflective Guard Jacket is suitable for a",
            "wide range of activities and occasions, making it ideal for workers",
            "who need to be easily seen in low-light conditions. Its unique feature",
            "is the way it catches the light, reflecting a rainbow-like spectrum",
            "that’s both eye-catching and practical for visibility. This amazing",
            "rainbow reflective jacket looks grey and unassuming until the light",
            "hits it, and then it takes on a bright rainbow glow. Our Reflective",
            "jacket is perfect for everything from athleisure wear to outdoor or",
            "safety wear for activities like cycling or riding a motorbike at night.",
            "Shell fabric: 40% Polyester, 60% 40Cotton DWR, 240 GSM",
            "100 Polyester Quilting- 250 GSM",
            "convenience. The classic beige color adds a touch of sophistication to",
            "any service wardrobe. Plus, with a blend of cotton and Spandex, these",
            "pants offer both comfort and flexibility for unrestricted movement.",
            "The TERRA OVERLAY shirt is an essential addition to any worker’s wardrobe",
            "in the services industry. It features a classic design that’s perfect for",
            "workwear and provides exceptional comfort for outdoor tasks. The soft",
            "twill fabric feels great against the skin and helps you maintain your",
            "elegance all day long. It’s also designed to offer a comfortable and",
            "supportive fit. The cotton content in the fabric keeps the shirt breathable.",
            "Shell Fabric: 67% Cotton, 30% Tencel, 3% Spandex, 200 GSM",
            "Shell Fabric: 55% Recycled Polyester, 35% Cotton, 10%Tencel, 200 GSM"
        ]
    },
    {
        "id": 106,
        "name": "Stalwart Windbreaker jacket",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 107,
        "name": "Super Besten convertible pants",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 108,
        "name": "SUSTAINABLE WORK JACKET",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 109,
        "name": "Sustainable-Fleece work trouser",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 110,
        "name": "Tencel Cargo Pants",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 111,
        "name": "Terra Overlay shirt",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 112,
        "name": "Titan Work Pants",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 113,
        "name": "Toil Softshell Anorak",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 114,
        "name": "Toil Workwear Cargo Pants",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 115,
        "name": "TORMUND2 ADVANCE TECH",
        "description": "Tormund2 is a multi-feature thoughtfully designed jacket combining the High visibility with a modern fit and stylish look. It offers industrial launderable stretch which is durable and comfortable. It comes with quilting option to keep wearers warm in adverse weather conditions. Our Tormund2 Advance Tech Jacket is integrated with Smart Led Visibility technology, offering programmable module integrated into the garment to make the worker visible at a distance in low light conditions. The smart Stay safe and visible in dangerous environments with the Lit- Armor High-Visibility FR Vest. This lightweight, flexible vest features FR active lighting technology, with integrated FR Lightning piping that is visible from up to 3 kilometers away. The LED lights can be turned on and off with a power button and have three different light modes to choose from. The vest is also lined with Meta Aramid lining, providing excellent heat and flame resistance. Its soft texture and flexibility make it ideal for use in low-lit or hot temperatures. The Ardor Advance Tech jacket offers augmented Heat Sensing technology with a stylish look of a high-performance softshell jacket. This multi-feature, DWR Softshell jacket is made using a durable softshell textile outer with attached quilting to give warmth and protect the wearer in cold working conditions. The integrated smart heating solution has programmable module which can be autoregulated with temperature control sensors. The Jacket has ample storage space through its spacious front pockets providing wearers with a practical selection. The Hi-Vis Illuminer Tech Jacket is a high-performance workwear jacket that provides comfort, ease of movement, and high visibility in low-light conditions. The jacket is made of industrial launderable stretch material and features Smart Led Visibility technology, a programmable module that provides high visibility through smart Textile fabri",
        "features": [
            "Dynamic module which is programmable to set up lighting",
            "signals based on worker activity.",
            "Allows you to be highly visible without being illuminated by a",
            "lighting source.",
            "Smart light patched on sleeves and back, Reflective tapes for",
            "Hi-visibility",
            "The Smart tech in the garment uses fiber and sensor",
            "technology to automate and optimize light cycles to provide",
            "better signaling protection.",
            "Warning of danger through different lighting scenarios created",
            "by the user: Static detection, Motion detection, Fall detection.",
            "Electronics can store and enable data analytics Features",
            "Lighting autonomy: 18h",
            "Washable and DWR shell fabric",
            "Front bellow pockets for storage",
            "High visibility over a long distance",
            "Detachable quilt and fur hood lining to keep the inside",
            "temperature warm and comf",
            "LIT-ARMOR FR VEST",
            "Flame Retardant fabric & trims",
            "3 modes of light intensity and flashing mode",
            "Good visibility (up to 2 km) in dark, fog, heavy rain, and snow",
            "Therien Heat sensing autoregulated module",
            "Battery and heating element Included",
            "Unique system: the only heated clothing kit adjusted inside the",
            "jacket, Disposable, lightweight and washable",
            "Centre front closure with full length water repellant zipper",
            "Interior quilt lining with added coverage on the back",
            "Armpit vents for ventilation",
            "Detachable and toggle adjustable hood",
            "Velcro® adjustable cuff tabs",
            "Connectivity : Bluetooth 5.3",
            "Heating electrical power : 18W max",
            "09",
            "midassafety.com",
            "HI-VIS ILLUMINER TECH JACKET"
        ],
        "fabrics": [
            "Shell fabric: 63% Cotton, 34% Polyester, 3% EOL 275gsm| 8.1 oz",
            "Quilting: 100% Polyester 120 gsm | 3.5 oz",
            "Shell fabric: 100% FR Recycled polyester PU coated, 200 GSM",
            "Lining: 100% Meta-aramid, 235 GSM",
            "07",
            "midassafety.com",
            "08",
            "midassafety.com",
            "ARDOR ADVANCE TECH JACKET",
            "Shell fabric: 94% Polyester, 6% Spandex TPU Softshell Fleece",
            "240gsm|7.1oz",
            "Quilting: 100% Polyester, 2x3. 120gsm | 3.5oz"
        ]
    },
    {
        "id": 116,
        "name": "Two tone Female coverall",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 117,
        "name": "VANTGUARD POLO SHIRT",
        "description": "Experience unparalleled comfort and performance with our classic work polo. Featuring a cut-and-sew design with contrasting piping, this polo offers exceptional moisture management and breathability. The lightweight mesh with contrasting fabric vents moisture, preventing buildup and keeping the wearer cool and comfortable throughout the work shift. Experience unparalleled comfort and performance with our classic pants designed to keep you comfortable and confident on the job. With durable materials, reinforced stitching, and multiple pockets for essential tools, these pants are built to withstand the demands of your daily routine. Whether you’re in healthcare, hospitality, or retail, our pants offer the perfect combination of style, function, and durability. Our 1020 shirt is a plain working shirt essential for your wardrobe. It is both smart and casual.  It features useful chest pockets and button-down collar for added detail. Our two-piece medical scrub for men is a great option for healthcare professionals who want to look stylish and professional. The eco-friendly scrub set features a unique triple-stitch design that enhances your appearance without compromising functionality. The V-neck top comes with multiple pockets, making it easy for you to access your essentials. The pants offer comfortable movement and flexibility for long shifts. Whether you’re a doctor, nurse, or any other healthcare professional, our two-piece medical scrub for men is the perfect choice to help you look and feel your best while at work. RUHE SCRUBS SET",
        "features": [
            "Classic straight-fit",
            "Back flap pockets",
            "Best for services industry",
            "Two side pockets",
            "Contrast side seams",
            "Underarms elbow vents",
            "Contrasting piping detail",
            "Contrast side vents",
            "Two button placket",
            "Arm cut & sew in hi-vis contrast piping",
            "79",
            "midassafety.com",
            "Shell Fabric: 65% Cotton, 35% Polyester, 200 GSM",
            "Shell Fabric: 65% Cotton, 35% Polyester Ripstop, 240 GSM",
            "80",
            "midassafety.com",
            "1020 SHIRT",
            "Button down closure",
            "Two front pockets with flaps.",
            "Adjustable cuffs",
            "HEALTH",
            "CARE",
            "ECO-BLUE SCRUBS SET",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "Darted front seams with multiple pockets",
            "Multiple bottom pockets",
            "82",
            "midassafety.com",
            "FRIEDEN SCRUBS SET",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "2 side pockets",
            "Straight-fit trousers",
            "Multiple bottom pockets",
            "Lightweight and long-lasting",
            "Relaxed fit",
            "V-neck, Short sleeves",
            "drawstring waistband",
            "2 side pockets",
            "Straight-fit trousers",
            "83",
            "midassafety.com",
            "Shell:  65% Polyester, 35% Cotton, 2/1 Twill, 160 GSM",
            "CUT",
            "RESISTANT",
            "85",
            "midassafety.com"
        ],
        "fabrics": [
            "100% cotton 200 gsm|5.9oz",
            "Shell: 81.5% PIW Cotton, 17.5% Reprieve Polyster, 1% Elastane, 340 GSM",
            "Our Men’s Casual Two-Piece Denim Medical Scrub is perfect for healthcare",
            "professionals who want to look and feel their best at work. This eco-friendly",
            "set features a unique triple-stitch design that adds a touch of style without",
            "compromising on professionalism. The V-neck top has multiple pockets",
            "that make it easy to access your essentials, while the pants are designed",
            "for comfort and mobility, allowing you to move with ease during long shifts.",
            "Whether you’re a doctor, nurse, or any other healthcare professional, this",
            "scrub will give you the confidence you need to perform your job with ease.",
            "Add a touch of excitement to your hectic workday with our Two-Tone",
            "Medical Scrub. This flattering-fit set features a V-neck and short sleeves",
            "for a stylish and professional look. The matching pants have an elastic",
            "waist for long-lasting comfort during your shift.",
            "Whether you’re a doctor, nurse, or other healthcare professional, our",
            "Two-Tone Medical Scrub is the perfect choice for those who want to look",
            "and feel their best while on the job.",
            "Shell:  50% Cotton, 50% Polyester, 190 GSM"
        ]
    },
    {
        "id": 118,
        "name": "VENTX SAFETY WINDBREAKER",
        "description": "",
        "features": [],
        "fabrics": []
    },
    {
        "id": 119,
        "name": "WEATHERPROOF MAVERICK JACKET",
        "description": "The jacket, crafted from two technical materials, features a unique quilted front panel that offers a contrasting appearance and color scheme. Its ultra- lightweight and shiny front panel quilting provides a technical appeal and ensures an incredibly comfortable fit. The original design incorporates a quilted front, while the sleeves and back are made of stretchable contrasting fabrics, allowing for unrestricted movement. This jacket is not only warm and stylish but also offers a distinctive look for those who want to stand out. It boasts practical Introducing a Reversible quilted parka perfect for fall. This parka This innovative weather-safe outerwear combines athleisure style with safety features. The jacket is crafted with a gradient reflective Midas Safety’s freezer coveralls are designed to keep you warm and protected in harsh work environments. The suit features heavy-duty zippers and wind-resistant flaps to keep out the elements, allowing you to focus on your work without worrying about freezing temperatures or moisture. Whether you’re working in cold storage, processing frozen food, or handling goods in refrigerated trucks, this insulated suit offers superior protection. It is designed with",
        "features": [
            "large zipped pockets. The water-repellent and down-proof fabric ensures",
            "maximum comfort and style during the cold season, making this jacket a perfect",
            "choice for anyone seeking both warmth and fashion.",
            "Stretch fabrics for mobility",
            "Drawcord and toggle adjuster hood",
            "DWR Zippers",
            "Front pocket",
            "Cut and sew for an ergonomic fit",
            "Shell fabric: 100% Recycled Polyester, 240 GSM",
            "70",
            "midassafety.com",
            "REVERSIBLE QUILTED PARKA",
            "construction to keep you dry in any weather. The quilted interior",
            "provides extra warmth, and the reversible style offers a sporty and",
            "urban twist on the classic quilted look. The parka has an elegant, slightly",
            "relaxed fit, making it ideal for layering over basic work attire without",
            "sacrificing style. It also includes a center-front zipper with a hidden-",
            "button storm flap, snap buttoned hood, and multiple pockets with",
            "contrasting colors to store the essentials.",
            "Centre front closure with full-length DWR zipper",
            "One side in cotton flannel, the other in quilted polyester.",
            "Chest pocket and two front pockets with clasp.",
            "Comfortable ribbed polyester cuffs and collar.",
            "Snap button detachable hood",
            "Multiple top and inside pockets",
            "Internal chest cell phone pocket on the left-hand side",
            "Shell fabric: 40% Polyester, 60% Cotton, DWR, 240 GSM",
            "100% Polyester, quilted 180 GSM",
            "71",
            "midassafety.com",
            "SPECTRO JACKET",
            "Centre front closure with full-length DWR zipper",
            "Detachable and toggle adjustable hood",
            "DWR Fabric",
            "Sustainable, Recycled Fleece fabric inside to ensure the wearer",
            "stays warm",
            "2 side pockets with waterproof zipper and  reflective piping details",
            "Cut & sew details for an ergonomic fit",
            "FREEZER WEAR COVERALL"
        ],
        "fabrics": [
            "Shell fabric: 90%Nylon,10%Spandex-300 Gsm",
            "Hi-Vis contrast: 75D/40D*75D/40D/300D, 92% Polyester and 8% Spandex-190 GSM",
            "Quilting Front Panel: 100% cotton 210 GSM",
            "sleek and modern look. The Reflective Guard Jacket is suitable for a",
            "wide range of activities and occasions, making it ideal for workers",
            "who need to be easily seen in low-light conditions. Its unique feature",
            "is the way it catches the light, reflecting a rainbow-like spectrum",
            "that’s both eye-catching and practical for visibility. This amazing",
            "rainbow reflective jacket looks grey and unassuming until the light",
            "hits it, and then it takes on a bright rainbow glow. Our Reflective",
            "jacket is perfect for everything from athleisure wear to outdoor or",
            "safety wear for activities like cycling or riding a motorbike at night."
        ]
    },
    {
        "id": 120,
        "name": "Work Utility Pants",
        "description": "",
        "features": [],
        "fabrics": []
    }
]